{
    "version": "https://jsonfeed.org/version/1",
    "title": "Forking the Docuverse Weblog",
    "home_page_url": "/forking_the_docuverse_weblog/",
    "feed_url": "/forking_the_docuverse_weblog/feed.json",
    "description": null,
    "icon": "/forking_the_docuverse_weblog/apple-touch-icon.png",
    "favicon": "/forking_the_docuverse_weblog/favicon.ico",
    "expired": false,
    
    "author": "Rebecca Rui",
    
"items": [
    
        {
            "id": "/forking_the_docuverse_weblog/17",
            "title": "Reflection and Further Developments",
            "summary": null,
            "content_text": "Research QuestionCan new approaches be taken to representational and interactive concepts for mapping and accessing the interconnective structure of documents, and what are the consequences?Which concepts?The concepts have been derived through examining prominent examples of systems comprising concepts representing interconnection.Those examples are:  The Encyclopédie by Denis Diderot ( 1713 - 1784) and Jean d’Alembert (1717 - 1783)  The work of Paul Otlet (1868 - 1944)  The original hypertext project Xanadu by Ted Nelson (1937)All three examples are considered influential in the evolution of information technologies. The Encyclopédie is exemplary of the eighteenth century; the work of Paul Otlet is exemplary of the nineteenth century; Xanadu by Ted Nelson is exemplary of the twentieth century.Published between 1751 and 1772, the Encyclopédie is seen as in response to the eighteenth-century information overload (Rosenberg 2015). It was an innovative system for its time, utilizing textual and diagrammatic ways of mapping structures.Otlet’s work is similarly seen as in response to the nineteenth-century problem of “the enormous growth in the number of publications, specialist congresses, and international exhibitions” (Manfroid 2013). Otlet is regarded as a pioneer of the field once called documentation that branched into what is now called information science, and his work can be understood as a nineteenth-century attempt to represent interconnection, inhibited by the material constraints of paper-based technologies.Since its conception, the Xanadu docuverse by Ted Nelson was envisioned to run on a global network of computers in which every document is to reside (Ridi 2018). Xanadu has never been fully implemented, but the many prototypes and writings throughout the decades since the 1960s have had a profound impact on the evolution of hypertext, influencing several projects, including the World Wide Web.All three examples are grounded in a philosophical position about the structure of ideas and evolution of knowledge (explained below). Through examination, some of the concepts and features of the three examples were deemed suitable for reflecting that philosophical position and therefore reworked in creating a docuverse. Other concepts derived from paper documents, such as footnotes, have been abandoned.  Modularization of documents.  Links are distinguished according to the type of connection.  Multiple renditions of content.  A closed system.1. Modularization of documentsThe structure of ideas is nonsequential. Hierarchy and sequence should not be the predominant structures into which everything must fit. A document system must therefore support mapping multiple structures. Knowledge is not fundamentally hierarchical, and the evolution of knowledge is a process of decomposition/recomposition, analysis/synthesis. Therefore, a document system should facilitate and support that process through the modularization of documents.In line with the conception of documents as modular — made up of parts connected to other parts — all connections to/from a document are implemented as visual links. The linked documents are represented as aliases, providing direct access to those linked documents. In contrast to web pages viewed in browsers, documents are not viewed in isolation, and selecting a link does not involve blindly landing on a page. An open document (in Lateral View) has its linked documents represented as aliases that clearly indicate the link’s destination (including the link direction and the link endpoint). Selecting an alias opens that linked document, while the previously opened document transforms into an alias (or multiple aliases if there are multiple links between those two documents).For example, Document A is open and has several links to Document B. Selecting an alias of Document B transforms Document B into an open document and transforms Document A into aliases.%%insert sketch%%2. Links are distinguished according to the type of connectionLinks are visually distinguished according to the type of connection that can be established. All connections belong to one of the three main link types:  Tag link –#–  Transclusion —-  Sequence link ↓1. Tag linkTag links are the arbitrary (conceptual) connections created between content items and can include a descriptive label (to describe that conceptual category). By utilizing the common usage of hashtags as a categorization mechanism, tag links enable the organization and filtering of links based on any taxonomy.Note: Tag links replace such concepts as footnotes. Unlike tag links, footnotes do not enable creating categories within all the footnotes (e.g., a comment, a reference, a definition). With tag links, there is also no implicit hierarchy; instead, multiple sequences are on the same level (e.g., the paragraph-by-paragraph sequence and the branches of linked documents).2. TransclusionTransclusion is the inclusion of (a part of) a document into another document. Content that is by convention put between quotation marks or in a block quote, for example, is a form of transclusion. In the Naxae docuverse, the visual form of transclusions is dashed lines pointing to an alias of the source document. Transclusions thus offer direct access to the “origins and context of quotations, excerpts and anthologized materials, and content transiting between versions” (Nelson 1999).Note: By convention (derived from paper documents), the content of digital documents is copied (onto the construct called clipboard) and pasted (with the manual insertion of a citation if taken from another source), whereas in the Nexae docuverse content items are never duplicated, they are transcluded (with a transclusion type link and an alias of the linked document).3. Sequence LinkSequence links determine the order of documents in a sequence. Accordingly, a sequence link can point to the previous or the next document in a sequence. Unlike transclusions and tag links, sequence links can only point to an entire document, not to a content item of a document. Headings can be applied to create a nested structure within the sequence (i.e., hierarchical order). The sequential order of documents (and the possible hierarchical order of content items within a document) co-exists with the order offered by the other two link types.Note: even if a set of content items belong in a hierarchical order within a document, it may simultaneously exist in another structure by establishing a link. Similarly, a list item in a nested list in one document may simultaneously (through transclusion) be a title in another document.Note: a document can be the second item in one sequence and the fifth item in another.Note: How sequences and hierarchies are organized can vary. For example, one sequence might be a set of documents containing one content item. That particular sequence would be akin to the concept of a chapter. Another sequence might be a set of documents containing multiple content items that belong to sections within a document (established through headings). This latter sequence would be similar to a set of chapters or a chapter with sub-chapters. Rather than numbering, as is often done with chapters, the order is indicated by the visual layout of the documents.The visual distinction of the three link types and the subcategorization enabled by tag links.The means of visually distinguishing different categories of information is by convention done typographically. The main text has a large font size, and additional information, such as footnotes, has a small font size, implying a hierarchical relationship. In the Nexae docuverse, information categories are assigned through the three link types, not a predefined hierarchical structure. So information that is by convention embedded as footnotes would be in separate documents to which metadata can be attached and a tag link label that describes the connection. There is no implicit hierarchy, and through filtering, it is possible to view a subcategory of the additional information.To convey further information about a connection, beyond the three link types, there are two link directions and two link endpoints.Link direction denotes whether:  a connection is established to a document, or  from a document.Most common on the web are one-directional links pointing to another (external) website or (internal) webpage. This linking mechanism forms a linear sequence structure. Additionally, since the link does indicate its destination, once it has been selected, the only way to retrieve the original web page is to navigate back by selecting the back button in the browser.Less common are backlinks, often implemented in what is called digital gardens. Backlinks are links that point from another document. If Document A contains a link to Document B, then Document B contains a backlink to Document A. Roam Research is known for popularizing backlinks, and others like Notion have followed suit. Usually, backlinks are presented in a list and commonly at the bottom, as seen in the three following images.In the example above, selecting a backlink results in instantly landing on a page. In the example below, selecting backlinks results in the document opening on the side, enabling a comparison of the two linked documents without leaving the document.In Notion, backlinks are hidden in a list that only expands upon deliberate action. Additionally, the list is underneath the title, not at the bottom.In all these examples, links pointing outward are inline hyperlinks, and links pointing inward are in a separate list, which means that the backlinks do not make available where exactly the document has been mentioned (the link endpoint) and also do not indicate how many times it has been mentioned (the number of links to a particular document).In Nexae, outward and inward links are not separated; both are inline, with the arrow symbol indicating the link direction. Additionally, because links can be attached at the level of the content item, unlike backlinks, the endpoint of a link provides direct access to the particular part of a document. If there are multiple links, then there are multiple aliases of the linked document.Link endpoints describes whether there is a connection to:  an entire document or  a part of a document.For example, the following sample sentence is a reference type of connection that points to an entire document:“In What Are Data, Christine Borgman reconceives ‘data’ through an etymological examination of ‘captum’ and ‘datum.’”By naming the title, a connection to the entire document is established. By naming specific examples, the sentence below establishes connections to several parts of the document.“In What Are Data, Christine Borgman examines different conceptions of data, from Paul Uhlir and David Cohen’s definition of data to the Data Documentation Initiative and categories of data developed by NASA.”3. Multiple renditions of contentSwitching View Modes and Traversing DocumentsThe Nexae docuverse is designed with two view modes. The two view modes are each different renditions of documents and linkages. Both view modes convey different information about the connections among documents. Inventory View is at the level of the collection, and Lateral View is at the level of the document. Differing in the level of detail, Inventory View is the zoomed-out view, and Lateral View is the zoomed-in view.Inventory View is a network diagram using a node-link model. All documents are viewed in relation to each other, conveying information about the size of each document (node size) and the number of links (line thickness). Functioning as an infographic, it allows understanding a lot of information at a glance.Inventory View:In Lateral View, one document is viewed in more detail, conveying information about the type of connections to/from that document.Lateral View (with a location frame of Inventory View in the upper-right corner):Additionally, documents and links can be filtered so that only a subset of the docuverse is in view.Note: these features are a solution to the problem of the complex information that results from mapping the various connections among documents.Switching view modes involves transition animations suggesting the movement of zooming in and out on documents. Switching from Inventory View to Lateral View is done by opening a document, equivalent to zooming in on a document.While in Lateral View (i.e., having opened a document), opening a linked document by selecting one of its aliases also brings about a transition animation. Additionally, a location frame shows the open document as an active node seen through the perspective of Inventory View (in the upper-right corner). The location frame, originating with cartography, is implemented to support orientation. Location frames are often implemented in software for editing media that involves zooming in and out on content (e.g., Adobe Illustrator, Miro).In contrast, opening web pages by selecting hyperlinks occurs instantly (i.e., landing on a page without a transition animation) and does not make the destination explicitly apparent. Some implementations on the web attempt to make the destination of links more apparent, such as the preview windows seen in Wikipedia (but only for internal links, i.e., other Wikipedia pages).These windows support quick decision-making for opening a link based on whether it is relevant content. However, these preview windows pop up and overlap the content, demanding attention and requiring deliberate action to get a glimpse. To circumvent these issues, Jeff Kaufman implemented preview windows so that they appear in a side panel rather than on top of the content.In Nexae, linked documents are idle aliases that are always visible (unless hidden by filtering links and documents). Additionally, the preview windows in the examples above only show the top part of the linked web page, not indicating whether the connection points to a particular part.In the Nexae docuverse, links can be attached on the level of the document but also the level of the content item. Aliases can therefore bring into view the particular content item to/from which the open document is linked. The visual form of the link additionally aids in conveying whether the connection points to the entire document or a part of the document.A bracketed link indicates that it is attached to the entire document. An unbracketed link indicates that it is linked to a particular content item within the document (in which case, the linked content item is displayed in purple).The insight gained from examining the Encyclopédie is that the entire contents can be arranged in a nested list (hierarchical structure) but can also be arranged in a node-link map to show the interconnective structure. Both structures can be mapped, and both are different lenses onto the contents, functioning as infographics and offering different entry points. So though the main aim of this project is to support mapping and accessing the interconnective structure of documents, that does entail excluding hierarchical and sequential arrangements but not giving them predominance. Again, documents are modular; multiple structures co-exist.Implementing two view modes is also an attempt to further develop Nelson’s implementation of Xanadu by dealing with the complexity that comes with mapping multiple structures.Similar to Xanadu, Nexae abandons the idea of embedding information; instead, metadata and links are attached. Improving the implementation of Xanadu, in Nexae conceptual categories are visually distinguished by applying a diagrammatic visual language, and all references are present (represented as aliases with direct access to the referenced document).On a web page, a content list or navigation sitemap provides people with an overview of the structure of a website. Selecting a list item directs them to the web page instantly. There is no longer an overview, and people do not know exactly where they are anymore. Looking at a list conveys the hierarchical structure of the website. The amount of information and number of links are also not available.Rather than the file system’s tree structure, or the blog format’s chronological structure, the collection of documents is represented as a node-link network. Entirely based on the interconnective structure, conveying information about the number of links and size of documents whereby the individual document is distinguished by title.Note: the display of titles should be configurable in the settings so that instead of titles, another variable from the metadata is displayed, such as the author (further discussed in the Future Developments section)). The arrangement of the node-link network should also be configurable, which is by default set to arranging the nodes according to sequence links.4. Closed systemTo support the core concepts that allow mapping and accessing multiple structures, Nexae is envisioned as a closed system. For example, the concept of transclusion dictates that concepts such as copying and pasting are not possible; instead, content is transcluded. If the content is taken from another document, it is done by inserting it into a document, generating an alias link to that document.To compare, websites built with wiki structures, such as digital gardens and Wikipedia, are very similar to the Encyclopédie in that they are semi-closed systems, meaning there is an emphasis on internal links, although establishing external links is possible. In both examples, internal links and external links are somehow visually distinguished. In the Wikipedia docuverse, internal links (links to other Wikipedia pages) are implemented as hyperlinks in the main text or panels with other categories of information located on the side of the main text. External links, which can be connections by way of reference or arbitrary connections, are implemented as footnotes, and the links are located at the bottom of the webpage. Selecting an external link results in leaving Wikipedia, whether that be a link to download a PDF or opening another website in another browser tab.Digital gardens also contain internal and external links, both applied as inline links and commonly visually distinguished. External links are visually distinguished from internal links by the northeast arrow symbol, as seen in the image below.In sum, Wikipedia has two main link types (external and internal), distinguished through layout design.Nexae has been designed with no external links because, in order to have direct access to a linked document, it must exist in the Nexae docuverse. Content is added rather than linked to external sources. The only distinction made is between documents that are private (only accessible to the person who added them) and public (accessible to everyone or a selection of people in the Nexae docuverse).Whereas Wikipedia is a public project to which (at least in principle) anyone can contribute, digital gardens are set up as more personal spaces, usually edited by one person. Conceptually, Nexae aspires to be a docuverse where (parts of ) digital gardens can merge, which occurs when documents are made public.What does the prototype offer (at this stage)?Nexae is the result of abandoning some concepts derived from paper documents and taking new approaches to other concepts; incorporating a diagrammatical visual language, features from contemporary software for editing media; the appropriation of the contemporary usage of hashtags; and the utilization of transition animations possible in interactive digital environments.The prototype at this stage offers pre-mapped sample content that has been written throughout the process of this project. The documents have the following attached metadata: title, year of creation, author, and tags. This list is extendible. The connections between the documents make use of all three link types. Each tag link has a descriptive label describing the connection between documents.%%image of example%%It is possible to traverse documents by selecting a document in Inventory View to enter Lateral View and select linked documents. It is, however, not yet possible to edit or add documents and links.It is possible to filter documents and links in Inventory View, enabling people to enter a subset of the docuverse.The default arrangement of documents and links in Inventory View is set according to the sequence links. However, many other arrangements based on the metadata and link types are possible and should be configurable (discussed below).The default interface should ideally also be configurable, for example, color-coding tag links according to their label or a different background color, etc.What needs to be explored or developed further, and how?There are many possibilities for further development of this project.Key features that need to be developed:  An edit mode  Extending the filtering technique  Arrangement of documents and links  Configurability  Overlapping links  Extending the closed system1. An edit modeThe prototype allows only for accessing the pre-mapped structures of the sample content, which means that the option to edit documents, links, or metadata is not yet possible.A problem that arises when implementing an edit mode is:  What happens when documents undergo changes?  What happens when adding a document with references to other documents that have not been added to the Nexae docuverse?  What happens when adding documents that contain concepts that have been abandoned, such as footnotes and citations?For the first, a time dimension would need to be developed so that different states of documents are stored and can be accessed in order to accommodate the reuse of intellectual elements (facilitate the process of decomposition/recomposition, analysis/synthesis of intellectual elements). How different versions of documents and linkages behave will need to be worked out.For the second, it could involve a prompt, asking whoever is adding the document also to add the referenced documents, or a computer program that searches the web for the linked documents and adds (and transforms) them automatically. If the documents are not found, then the question is, what would the visual implementation of a missing linked document look like and function?Thirdly, adding a document with several footnotes could entail each footnote becoming a separate document linked to the added document as a tag link.Through NLP techniques, suggestions for labels of the tag links and metadata to the document could be provided, which the user would manually confirm. Alternatively, the suggestions could be skipped, and the tag link labels would have to be done manually.2. Extending the filtering techniqueA key problem with mapping multiple structures is that it inevitably leads to complex overlapping information. Filtering documents and links have been proposed as a way to deal with the complexity of information.As it is now, it is very basic filtering — select a tag to view only that tag. This could be further explored by designing ways for organizing and selecting sets of tags according to presets. Presets would allow people to navigate the docuverse by viewing only a subset instead of (de)selecting each tag individually.Seeing as multiple taxonomies would co-exist in the Nexea docuverse, another question is how people can share their presets of their developed taxonomies.3. Arrangement of documents and linksBeyond utilizing metadata for filtering, it could also be utilized for arranging documents in Inventory View to gain an infographic-like overview. Functioning as an infographic, Inventory View allows understanding of a lot of information at a glance. For example, someone might be investigating the concept of evolution, and the inventory might look like this:In the metadata menu, #evolution is selected (or a preset named Evolution that contains a set of related tag labels), and so the inventory looks like this:From here, it should be possible to arrange the documents according to the set sequences (determined by the established sequence links).Alternatively, according to the date of publication, rendered in a timeline view:The idea is for the ability to rearrange the configuration of the nodes and links to get different renditions of the collection of documents, i.e., different infographic-like overviews.4. ConfigurabilityThe default configuration of Inventory View displays the title of a document above each node but should be configurable to display any metadata unit (e.g., year, particular tag, author).Similar to most plain text editors (Atom, Sublime Text 3) and Markdown editors (Obsidian, Typora), configuring the UI theme should also be possible. Obsidian, for example, can be configured to have documents stacked side by side as sliding panels:Or as multiple windows in different sizes within the main window:5. Overlapping linksThe idea is that instead of embedding links (and metadata), it is attached. In this way, links are an overlay on top of the content. However, the interaction and visual implementation of overlapping links still need to be explored. Below is a sketch of stacking multiple links to the same content item in the form of a deck. Upon hovering on an alias, it comes to the front, and it should be possible to rearrange the order.6. Extending the closed systemMaking documents by another author publicContent is added to the Nexae docuverse rather than linked.Based on the premise that there can be no copies, what happens if a document is made public that has already been added by someone else? If a document has already been added to the Nexae docuverse, it would have to merge with the existing document (links and metadata).Sharing and collaboratingOnce a document is made public, it should be possible to configure the edit settings. For example, granting someone the full edit mode would allow them to edit the contents and links. Granting someone the limited edit mode would allow them only to create links to that document. In both cases, it should be possible to grant access to either a select number of people or everyone in the Nexae docuverse.%%An experiment could involve a bottom-up approach to see how taxonomies evolve and how they could be shared. Bottom-up approach versus top-bottom: https://youtu.be/AhhFLXfldJQ?t=86%%Copyright issuesA problem that emerges with making documents public in the Nexae docuverse is copyright issues. If a document is made public, the person who adds it should have the right to do so.ConclusionA prototype of a docuverse has been developed by taking new approaches to representational and interactive concepts for mapping and accessing the interconnective structure of documents. In its current state, the prototype is in the proof of concept stage. Containing sample content developed throughout the process, the prototype provides an example of how the three main link types can be applied to map the interconnective structure of documents and how it can be accessed through interaction.With the aim to reflect the philosophical position that ideas are nonsequential and that knowledge is not fundamentally hierarchical and is a continuous process of decomposition/recomposition, analysis/synthesis, the prototype has been developed based on the conception of documents as modular.To accommodate the modularization of documents, links are distinguished according to three types of connection. There are three link types: transclusion, tag link, and sequence link. The three main link types enable the formation of non-hierarchical and hierarchical structures. A transclusion-type link enables a content item to be inserted into other documents with direct access to its origin. By utilizing the common usage of hashtags as a categorization mechanism, tag links make it possible to describe the arbitrary (conceptual) connections by including a label. Sequence links enable establishing the order of documents. In combination with headings within a document, sequence links allow the possibility of creating hierarchical structures. Links are implemented through a diagrammatic visual language, specifically lines with arrow symbols and an alias window of the linked document.To convey further information about a connection, beyond the three link types, there are two link directions and two link endpoints. The direction of a link is indicated by an arrow symbol. The link endpoints describe whether there is a connection to an entire document or a part of a document, providing direct access to that particular part. A bracketed line indicates that the link is attached to the entire document; an unbracketed line indicates that the link is attached to a particular content item within the document.The two view modes are each different renditions of documents and linkages. Both view modes convey different information about the connections among documents at different levels of detail. The zoomed-out view is at the level of the collection, and the zoomed-in view is at the level of the document. The zoomed-out view is a network diagram using a node-link model. All documents are viewed in relation to each other, conveying information about the size of each document (node size) and the number of links (line thickness). Functioning as an infographic, it allows understanding a lot of information at a glance. In zoomed-in view, the selected document is viewed in more detail, conveying information about the type of connections to/from that document.Switching view modes involves transition animations suggesting the movement of zooming in and out on documents. While in zoomed-in view, opening a linked document by selecting one of its aliases also brings about a transition animation, moving laterally. Additionally, a location frame shows the open document as an active node seen from the zoomed-out perspective, which supports orientation. Additionally, documents and links can be filtered so that only a subset of the docuverse is in view.Nexae has been designed as a closed system (i.e., with no external links) because, in order to have direct access to a linked document, it must exist in the Nexae docuverse. Similarly, aliases of linked documents and for links to point to particular parts of a document rely on that document existing in the Nexae docuverse.This project is a small step toward a docuverse enabling new ways of mapping and accessing the interconnective structure of documents in the context of an online document system.The proposed next steps in that larger process involve determining the technical implementation and:  developing an edit mode with a time dimension;  extending the filtering technique;  developing a feature allowing the arrangement of documents to produce different renditions based on metadata;  developing a feature for overlapping links;  and extending the closed system.These features would bring the prototype to a functional stage and could then be used for objectives such as:  finding the advantages and challenges in:          the bottom-up approach in creating taxonomies (instead of the top-down approach of hierarchical systems);      sharing taxonomies;      filtering as a technique for dealing with the complexity of information;      %%and explain what it brings to navigating documents. In two sentences, what does the bottom-up approach bring? What do you intend to achieve with it? what would it potentially bring?%%%%Some concepts and practices derived from paper documents — particularly embedded information in the form of concepts such as footnotes — have been abandoned. The hierarchical organization of documents and content items has been reworked around the conception of documents as modular. In abandoning the hierarchical structure of the file system, a more flexible mechanism for categorization has been implemented, namely the common usage of hashtags, allowing a document and links to belong to multiple categories. Other abandoned concepts derived from paper documents include the clipboard and the related copy/paste method.%%",
            "content_html": "<h2 id=\"research-question\">Research Question</h2><p>Can new approaches be taken to representational and interactive concepts for mapping and accessing the interconnective structure of documents, and what are the consequences?</p><h2 id=\"which-concepts\">Which concepts?</h2><p>The concepts have been derived through examining prominent examples of systems comprising concepts representing interconnection.</p><p>Those examples are:</p><ol>  <li>The Encyclopédie by Denis Diderot ( 1713 - 1784) and Jean d’Alembert (1717 - 1783)</li>  <li>The work of Paul Otlet (1868 - 1944)</li>  <li>The original hypertext project Xanadu by Ted Nelson (1937)</li></ol><p>All three examples are considered influential in the evolution of information technologies. The Encyclopédie is exemplary of the eighteenth century; the work of Paul Otlet is exemplary of the nineteenth century; Xanadu by Ted Nelson is exemplary of the twentieth century.</p><p>Published between 1751 and 1772, the Encyclopédie is seen as in response to the eighteenth-century information overload (Rosenberg 2015). It was an innovative system for its time, utilizing textual and diagrammatic ways of mapping structures.</p><p>Otlet’s work is similarly seen as in response to the nineteenth-century problem of “the enormous growth in the number of publications, specialist congresses, and international exhibitions” (Manfroid 2013). Otlet is regarded as a pioneer of the field once called documentation that branched into what is now called information science, and his work can be understood as a nineteenth-century attempt to represent interconnection, inhibited by the material constraints of paper-based technologies.</p><p>Since its conception, the Xanadu docuverse by Ted Nelson was envisioned to run on a global network of computers in which every document is to reside (Ridi 2018). Xanadu has never been fully implemented, but the many prototypes and writings throughout the decades since the 1960s have had a profound impact on the evolution of hypertext, influencing several projects, including the World Wide Web.</p><p>All three examples are grounded in a philosophical position about the structure of ideas and evolution of knowledge (explained below). Through examination, some of the concepts and features of the three examples were deemed suitable for reflecting that philosophical position and therefore reworked in creating a docuverse. Other concepts derived from paper documents, such as footnotes, have been abandoned.</p><ol>  <li>Modularization of documents.</li>  <li>Links are distinguished according to the type of connection.</li>  <li>Multiple renditions of content.</li>  <li>A closed system.</li></ol><h3 id=\"1-modularization-of-documents\">1. Modularization of documents</h3><p>The structure of ideas is nonsequential. Hierarchy and sequence should not be the predominant structures into which everything must fit. A document system must therefore support mapping multiple structures. Knowledge is not fundamentally hierarchical, and the evolution of knowledge is a process of decomposition/recomposition, analysis/synthesis. Therefore, a document system should facilitate and support that process through the modularization of documents.</p><p>In line with the conception of documents as modular — made up of parts connected to other parts — all connections to/from a document are implemented as visual links. The linked documents are represented as aliases, providing direct access to those linked documents. In contrast to web pages viewed in browsers, documents are not viewed in isolation, and selecting a link does not involve blindly landing on a page. An open document (in Lateral View) has its linked documents represented as aliases that clearly indicate the link’s destination (including the link direction and the link endpoint). Selecting an alias opens that linked document, while the previously opened document transforms into an alias (or multiple aliases if there are multiple links between those two documents).</p><p>For example, <em>Document A</em> is open and has several links to <em>Document B</em>. Selecting an alias of <em>Document B</em> transforms <em>Document B</em> into an open document and transforms <em>Document A</em> into aliases.</p><p>%%insert sketch%%</p><h3 id=\"2-links-are-distinguished-according-to-the-type-of-connection\">2. Links are distinguished according to the type of connection</h3><p>Links are visually distinguished according to the <em>type of connection</em> that can be established. All connections belong to one of the three main <strong>link types</strong>:</p><ul>  <li>Tag link –#–</li>  <li>Transclusion —-</li>  <li>Sequence link ↓</li></ul><p><img src=\"assets/three_link_types.png\" alt=\"\" /></p><p><strong>1. Tag link</strong></p><p>Tag links are the arbitrary (conceptual) connections created between content items and can include a descriptive label (to describe that conceptual category). By utilizing the common usage of hashtags as a categorization mechanism, tag links enable the organization and filtering of links based on any taxonomy.</p><p>Note: Tag links replace such concepts as footnotes. Unlike tag links, footnotes do not enable creating categories within all the footnotes (e.g., a comment, a reference, a definition). With tag links, there is also no implicit hierarchy; instead, multiple sequences are on the same level (e.g., the paragraph-by-paragraph sequence and the branches of linked documents).</p><p><strong>2. Transclusion</strong></p><p>Transclusion is the inclusion of (a part of) a document into another document. Content that is by convention put between quotation marks or in a block quote, for example, is a <em>form</em> of transclusion. In the Naxae docuverse, the visual form of transclusions is dashed lines pointing to an alias of the source document. Transclusions thus offer direct access to the “origins and context of quotations, excerpts and anthologized materials, and content transiting between versions” (Nelson 1999).</p><p>Note: By convention (derived from paper documents), the content of digital documents is copied (onto the construct called clipboard) and pasted (with the manual insertion of a citation if taken from another source), whereas in the Nexae docuverse content items are never duplicated, they are transcluded (with a transclusion type link and an alias of the linked document).</p><p><strong>3. Sequence Link</strong></p><p>Sequence links determine the order of documents in a sequence. Accordingly, a sequence link can point to the previous or the next document in a sequence. Unlike transclusions and tag links, sequence links can only point to an entire document, not to a content item of a document. Headings can be applied to create a nested structure within the sequence (i.e., hierarchical order). The sequential order of documents (and the possible hierarchical order of content items within a document) co-exists with the order offered by the other two link types.</p><p>Note: even if a set of content items belong in a hierarchical order within a document, it may simultaneously exist in another structure by establishing a link. Similarly, a list item in a nested list in one document may simultaneously (through transclusion) be a title in another document.</p><p>Note: a document can be the second item in one sequence and the fifth item in another.</p><p>Note: How sequences and hierarchies are organized can vary. For example, one sequence might be a set of documents containing one content item. That particular sequence would be akin to the concept of a chapter. Another sequence might be a set of documents containing multiple content items that belong to sections within a document (established through headings). This latter sequence would be similar to a set of chapters or a chapter with sub-chapters. Rather than numbering, as is often done with chapters, the order is indicated by the visual layout of the documents.</p><p><strong>The visual distinction of the three link types and the subcategorization enabled by tag links.</strong></p><p>The means of visually distinguishing different categories of information is by convention done typographically. The main text has a large font size, and additional information, such as footnotes, has a small font size, implying a hierarchical relationship. In the Nexae docuverse, information categories are assigned through the three link types, not a predefined hierarchical structure. So information that is by convention embedded as footnotes would be in separate documents to which metadata can be attached and a tag link label that describes the connection. There is no implicit hierarchy, and through filtering, it is possible to view a subcategory of the additional information.</p><p>To convey further information about a connection, beyond the three link types, there are two link directions and two link endpoints.</p><p><strong>Link direction</strong> denotes whether:</p><ol>  <li>a connection is established <em>to</em> a document, or</li>  <li><em>from</em> a document.</li></ol><p>Most common on the web are one-directional links pointing <em>to</em> another (external) website or (internal) webpage. This linking mechanism forms a linear sequence structure. Additionally, since the link does indicate its destination, once it has been selected, the only way to retrieve the original web page is to navigate back by selecting the back button in the browser.</p><p>Less common are backlinks, often implemented in what is called digital gardens. Backlinks are links that point <em>from</em> another document. If <em>Document A</em> contains a link to <em>Document B</em>, then <em>Document B</em> contains a backlink to <em>Document A</em>. Roam Research is known for popularizing backlinks, and others like Notion have followed suit. Usually, backlinks are presented in a list and commonly at the bottom, as seen in the three following images.</p><p><img src=\"assets/backlinks_list_1.gif\" alt=\"\" /></p><p>In the example above, selecting a backlink results in instantly <em>landing on a page</em>. In the example below, selecting backlinks results in the document opening on the side, enabling a comparison of the two linked documents without leaving the document.</p><p><img src=\"assets/backlinks_list_2.gif\" alt=\"\" /></p><p>In Notion, backlinks are hidden in a list that only expands upon deliberate action. Additionally, the list is underneath the title, not at the bottom.</p><p><img src=\"assets/backlinks_list_3.gif\" alt=\"\" /></p><p>In all these examples, links pointing outward are inline hyperlinks, and links pointing inward are in a separate list, which means that the backlinks do not make available where exactly the document has been mentioned (the link endpoint) and also do not indicate how many times it has been mentioned (the number of links to a particular document).</p><p>In Nexae, outward and inward links are not separated; both are inline, with the arrow symbol indicating the link direction. Additionally, because links can be attached at the level of the content item, unlike backlinks, the endpoint of a link provides direct access to the particular part of a document. If there are multiple links, then there are multiple aliases of the linked document.</p><p><strong>Link endpoints</strong> describes whether there is a connection to:</p><ol>  <li>an entire document or</li>  <li>a part of a document.</li></ol><p>For example, the following sample sentence is a reference type of connection that points to an entire document:</p><p>“In <em>What Are Data</em>, Christine Borgman reconceives ‘data’ through an etymological examination of ‘captum’ and ‘datum.’”</p><p>By naming the title, a connection to the entire document is established. By naming specific examples, the sentence below establishes connections to several parts of the document.</p><p>“In <em>What Are Data</em>, Christine Borgman examines different conceptions of data, from Paul Uhlir and David Cohen’s definition of data to the Data Documentation Initiative and categories of data developed by NASA.”</p><h3 id=\"3-multiple-renditions-of-content\">3. Multiple renditions of content</h3><p><strong>Switching View Modes and Traversing Documents</strong></p><p>The Nexae docuverse is designed with two view modes. The two view modes are each different renditions of documents and linkages. Both view modes convey different information about the connections among documents. Inventory View is at the level of the collection, and Lateral View is at the level of the document. Differing in the level of detail, Inventory View is the <em>zoomed-out</em> view, and Lateral View is the <em>zoomed-in</em> view.</p><p>Inventory View is a network diagram using a node-link model. All documents are viewed in relation to each other, conveying information about the size of each document (node size) and the number of links (line thickness). Functioning as an infographic, it allows understanding a lot of information at a glance.</p><p>Inventory View:</p><p><img src=\"assets/inventory_view.png\" alt=\"\" /></p><p>In Lateral View, one document is viewed in more detail, conveying information about the type of connections to/from that document.</p><p>Lateral View (with a location frame of Inventory View in the upper-right corner):</p><p><img src=\"assets/lateral_view.png\" alt=\"\" /></p><p>Additionally, documents and links can be filtered so that only a subset of the docuverse is in view.</p><p>Note: these features are a solution to the problem of the complex information that results from mapping the various connections among documents.</p><p><img src=\"assets/filtering.gif\" alt=\"\" /></p><p>Switching view modes involves transition animations suggesting the movement of zooming in and out on documents. Switching from Inventory View to Lateral View is done by opening a document, equivalent to zooming in on a document.</p><p><img src=\"assets/zooming.gif\" alt=\"\" /></p><p>While in Lateral View (i.e., having opened a document), opening a linked document by selecting one of its aliases also brings about a transition animation. Additionally, a location frame shows the open document as an active node seen through the perspective of Inventory View (in the upper-right corner). The location frame, originating with cartography, is implemented to support orientation. Location frames are often implemented in software for editing media that involves zooming in and out on content (e.g., Adobe Illustrator, Miro).</p><p><img src=\"assets/selecting_alias.gif\" alt=\"\" /></p><p>In contrast, opening web pages by selecting hyperlinks occurs instantly (i.e., <em>landing on a page</em> without a transition animation) and does not make the destination explicitly apparent. Some implementations on the web attempt to make the destination of links more apparent, such as the preview windows seen in Wikipedia (but only for internal links, i.e., other Wikipedia pages).</p><p><img src=\"assets/preview_on_top.gif\" alt=\"\" /></p><p>These windows support quick decision-making for opening a link based on whether it is relevant content. However, these preview windows pop up and overlap the content, demanding attention and requiring deliberate action to get a glimpse. To circumvent these issues, Jeff Kaufman implemented preview windows so that they appear in a side panel rather than on top of the content.</p><p><img src=\"assets/preview_on_side.gif\" alt=\"\" /></p><p>In Nexae, linked documents are idle aliases that are always visible (unless hidden by filtering links and documents). Additionally, the preview windows in the examples above only show the top part of the linked web page, not indicating whether the connection points to a particular part.</p><p>In the Nexae docuverse, links can be attached on the level of the document but also the level of the content item. Aliases can therefore bring into view the particular content item to/from which the open document is linked. The visual form of the link additionally aids in conveying whether the connection points to the entire document or a part of the document.</p><p><img src=\"assets/bracket_link_endpoint.png\" alt=\"\" /></p><p>A bracketed link indicates that it is attached to the entire document. An unbracketed link indicates that it is linked to a particular content item within the document (in which case, the linked content item is displayed in purple).</p><p>The insight gained from examining the Encyclopédie is that the entire contents can be arranged in a nested list (hierarchical structure) but can also be arranged in a node-link map to show the interconnective structure. Both structures can be mapped, and both are different lenses onto the contents, functioning as infographics and offering different entry points. So though the main aim of this project is to support mapping and accessing the interconnective structure of documents, that does entail excluding hierarchical and sequential arrangements but not giving them predominance. Again, documents are modular; multiple structures co-exist.</p><p>Implementing two view modes is also an attempt to further develop Nelson’s <a href=\"https://xanadu.com/xanademos/MoeJusteOrigins.html\">implementation of Xanadu</a> by dealing with the complexity that comes with mapping multiple structures.</p><p>Similar to Xanadu, Nexae abandons the idea of embedding information; instead, metadata and links are attached. Improving the implementation of Xanadu, in Nexae conceptual categories are visually distinguished by applying a diagrammatic visual language, and all references are present (represented as aliases with direct access to the referenced document).</p><p>On a web page, a content list or navigation sitemap provides people with an overview of the structure of a website. Selecting a list item directs them to the web page instantly. There is no longer an overview, and people do not know exactly where they are anymore. Looking at a list conveys the hierarchical structure of the website. The amount of information and number of links are also not available.</p><p>Rather than the file system’s tree structure, or the blog format’s chronological structure, the collection of documents is represented as a node-link network. Entirely based on the interconnective structure, conveying information about the number of links and size of documents whereby the individual document is distinguished by title.</p><p>Note: the display of titles should be configurable in the settings so that instead of titles, another variable from the metadata is displayed, such as the author (further discussed in the Future Developments section)). The arrangement of the node-link network should also be configurable, which is by default set to arranging the nodes according to sequence links.</p><p><img src=\"assets/arranged_by_sequence.gif\" alt=\"\" /></p><h3 id=\"4-closed-system\">4. Closed system</h3><p>To support the core concepts that allow mapping and accessing multiple structures, Nexae is envisioned as a closed system. For example, the concept of transclusion dictates that concepts such as <em>copying</em> and <em>pasting</em> are not possible; instead, content is transcluded. If the content is taken from another document, it is done by inserting it into a document, generating an alias link to that document.</p><p>To compare, websites built with wiki structures, such as digital gardens and Wikipedia, are very similar to the Encyclopédie in that they are semi-closed systems, meaning there is an emphasis on internal links, although establishing external links is possible. In both examples, internal links and external links are somehow visually distinguished. In the Wikipedia docuverse, internal links (links to other Wikipedia pages) are implemented as hyperlinks in the main text or panels with other categories of information located on the side of the main text. External links, which can be connections by way of reference or arbitrary connections, are implemented as footnotes, and the links are located at the bottom of the webpage. Selecting an external link results in leaving Wikipedia, whether that be a link to download a PDF or opening another website in another browser tab.</p><p><img src=\"assets/wikipedia_internal_external_links.png\" alt=\"\" /></p><p>Digital gardens also contain internal and external links, both applied as inline links and commonly visually distinguished. External links are visually distinguished from internal links by the northeast arrow symbol, as seen in the image below.</p><p><img src=\"assets/example_internal_external_distinction.png\" alt=\"\" /></p><p>In sum, Wikipedia has two main link types (external and internal), distinguished through layout design.</p><p><img src=\"assets/wikipedia_semi-open_system.png\" alt=\"\" />Nexae has been designed with no external links because, in order to have direct access to a linked document, it must exist in the Nexae docuverse. Content is added rather than linked to external sources. The only distinction made is between documents that are private (only accessible to the person who added them) and public (accessible to everyone or a selection of people in the Nexae docuverse).</p><p><img src=\"assets/nexae_closed_system.png\" alt=\"\" />Whereas Wikipedia is a public project to which (at least in principle) anyone can contribute, digital gardens are set up as more personal spaces, usually edited by one person. Conceptually, Nexae aspires to be a docuverse where (parts of ) digital gardens can merge, which occurs when documents are made public.</p><h2 id=\"what-does-the-prototype-offer-at-this-stage\">What does the prototype offer (at this stage)?</h2><p>Nexae is the result of abandoning some concepts derived from paper documents and taking new approaches to other concepts; incorporating a diagrammatical visual language, features from contemporary software for editing media; the appropriation of the contemporary usage of hashtags; and the utilization of transition animations possible in interactive digital environments.</p><p>The prototype at this stage offers pre-mapped sample content that has been written throughout the process of this project. The documents have the following attached metadata: title, year of creation, author, and tags. This list is extendible. The connections between the documents make use of all three link types. Each tag link has a descriptive label describing the connection between documents.</p><p>%%image of example%%</p><p>It is possible to traverse documents by selecting a document in Inventory View to enter Lateral View and select linked documents. It is, however, not yet possible to edit or add documents and links.</p><p>It is possible to filter documents and links in Inventory View, enabling people to enter a subset of the docuverse.</p><p>The default arrangement of documents and links in Inventory View is set according to the sequence links. However, many other arrangements based on the metadata and link types are possible and should be configurable (discussed below).</p><p>The default interface should ideally also be configurable, for example, color-coding tag links according to their label or a different background color, etc.</p><h2 id=\"what-needs-to-be-explored-or-developed-further-and-how\">What needs to be explored or developed further, and how?</h2><p>There are many possibilities for further development of this project.</p><p>Key features that need to be developed:</p><ol>  <li>An edit mode</li>  <li>Extending the filtering technique</li>  <li>Arrangement of documents and links</li>  <li>Configurability</li>  <li>Overlapping links</li>  <li>Extending the closed system</li></ol><h3 id=\"1-an-edit-mode\">1. An edit mode</h3><p>The prototype allows only for accessing the pre-mapped structures of the sample content, which means that the option to edit documents, links, or metadata is not yet possible.</p><p>A problem that arises when implementing an edit mode is:</p><ul>  <li>What happens when documents undergo changes?</li>  <li>What happens when adding a document with references to other documents that have not been added to the Nexae docuverse?</li>  <li>What happens when adding documents that contain concepts that have been abandoned, such as footnotes and citations?</li></ul><p>For the first, a time dimension would need to be developed so that different states of documents are stored and can be accessed in order to accommodate the reuse of intellectual elements (facilitate the process of decomposition/recomposition, analysis/synthesis of intellectual elements). How different versions of documents and linkages behave will need to be worked out.</p><p>For the second, it could involve a prompt, asking whoever is adding the document also to add the referenced documents, or a computer program that searches the web for the linked documents and adds (and transforms) them automatically. If the documents are not found, then the question is, what would the visual implementation of a missing linked document look like and function?</p><p>Thirdly, adding a document with several footnotes could entail each footnote becoming a separate document linked to the added document as a tag link.</p><p><img src=\"assets/nexea_importing.png\" alt=\"\" />Through NLP techniques, suggestions for labels of the tag links and metadata to the document could be provided, which the user would manually confirm. Alternatively, the suggestions could be skipped, and the tag link labels would have to be done manually.</p><h3 id=\"2-extending-the-filtering-technique\">2. Extending the filtering technique</h3><p>A key problem with mapping multiple structures is that it inevitably leads to complex overlapping information. Filtering documents and links have been proposed as a way to deal with the complexity of information.</p><p>As it is now, it is very basic filtering — select a tag to view only that tag. This could be further explored by designing ways for organizing and selecting sets of tags according to presets. Presets would allow people to navigate the docuverse by viewing only a subset instead of (de)selecting each tag individually.</p><p>Seeing as multiple taxonomies would co-exist in the Nexea docuverse, another question is how people can share their presets of their developed taxonomies.</p><h3 id=\"3-arrangement-of-documents-and-links\">3. Arrangement of documents and links</h3><p>Beyond utilizing metadata for filtering, it could also be utilized for arranging documents in Inventory View to gain an infographic-like overview. Functioning as an infographic, Inventory View allows understanding of a lot of information at a glance. For example, someone might be investigating the concept of evolution, and the inventory might look like this:</p><p><img src=\"assets/filtering_arranging_01.png\" alt=\"\" /></p><p>In the metadata menu, <code class=\"language-plaintext highlighter-rouge\">#evolution</code> is selected (or a preset named <em>Evolution</em> that contains a set of related tag labels), and so the inventory looks like this:</p><p><img src=\"assets/filtering_arranging_02.png\" alt=\"\" />From here, it should be possible to arrange the documents according to the set sequences (determined by the established sequence links).</p><p><img src=\"assets/filtering_arranging_03.png\" alt=\"\" />Alternatively, according to the date of publication, rendered in a timeline view:</p><p><img src=\"assets/filtering_arranging_04.png\" alt=\"\" /></p><p>The idea is for the ability to rearrange the configuration of the nodes and links to get different renditions of the collection of documents, i.e., different infographic-like overviews.</p><h3 id=\"4-configurability\">4. Configurability</h3><p>The default configuration of Inventory View displays the title of a document above each node but should be configurable to display any metadata unit (e.g., year, particular tag, author).</p><p><img src=\"assets/node_with_title.png\" alt=\"\" /></p><p>Similar to most plain text editors (Atom, Sublime Text 3) and Markdown editors (Obsidian, Typora), configuring the UI theme should also be possible. Obsidian, for example, can be configured to have documents stacked side by side as sliding panels:</p><p><img src=\"assets/obsidian_theme_slide_panels.png\" alt=\"\" /></p><p>Or as multiple windows in different sizes within the main window:</p><p><img src=\"assets/obsidian_theme_traffic_lights.png\" alt=\"\" /></p><h3 id=\"5-overlapping-links\">5. Overlapping links</h3><p>The idea is that instead of embedding links (and metadata), it is attached. In this way, links are an overlay on top of the content. However, the interaction and visual implementation of overlapping links still need to be explored. Below is a sketch of stacking multiple links to the same content item in the form of a deck. Upon hovering on an alias, it comes to the front, and it should be possible to rearrange the order.</p><p><img src=\"assets/nexae_overlapping_links_deck.png\" alt=\"\" /></p><h3 id=\"6-extending-the-closed-system\">6. Extending the closed system</h3><p><strong>Making documents by another author public</strong></p><p>Content is added to the Nexae docuverse rather than linked.</p><p>Based on the premise that there can be no copies, what happens if a document is made public that has already been added by someone else? If a document has already been added to the Nexae docuverse, it would have to merge with the existing document (links and metadata).</p><p><strong>Sharing and collaborating</strong></p><p>Once a document is made public, it should be possible to configure the edit settings. For example, granting someone the <em>full edit mode</em> would allow them to edit the contents and links. Granting someone the <em>limited edit mode</em> would allow them only to create links to that document. In both cases, it should be possible to grant access to either a select number of people or everyone in the Nexae docuverse.</p><p>%%An experiment could involve a bottom-up approach to see how taxonomies evolve and how they could be shared. Bottom-up approach versus top-bottom: https://youtu.be/AhhFLXfldJQ?t=86%%</p><p><strong>Copyright issues</strong></p><p>A problem that emerges with making documents public in the Nexae docuverse is copyright issues. If a document is made public, the person who adds it should have the right to do so.</p><h2 id=\"conclusion\">Conclusion</h2><p>A prototype of a docuverse has been developed by taking new approaches to representational and interactive concepts for mapping and accessing the interconnective structure of documents. In its current state, the prototype is in the proof of concept stage. Containing sample content developed throughout the process, the prototype provides an example of how the three main link types can be applied to map the interconnective structure of documents and how it can be accessed through interaction.</p><p>With the aim to reflect the philosophical position that ideas are nonsequential and that knowledge is not fundamentally hierarchical and is a continuous process of decomposition/recomposition, analysis/synthesis, the prototype has been developed based on the conception of documents as modular.</p><p>To accommodate the modularization of documents, links are distinguished according to three types of connection. There are three link types: transclusion, tag link, and sequence link. The three main link types enable the formation of non-hierarchical and hierarchical structures. A transclusion-type link enables a content item to be inserted into other documents with direct access to its origin. By utilizing the common usage of hashtags as a categorization mechanism, tag links make it possible to describe the arbitrary (conceptual) connections by including a label. Sequence links enable establishing the order of documents. In combination with headings within a document, sequence links allow the possibility of creating hierarchical structures. Links are implemented through a diagrammatic visual language, specifically lines with arrow symbols and an alias window of the linked document.</p><p>To convey further information about a connection, beyond the three link types, there are two link directions and two link endpoints. The direction of a link is indicated by an arrow symbol. The link endpoints describe whether there is a connection to an entire document or a part of a document, providing direct access to that particular part. A bracketed line indicates that the link is attached to the entire document; an unbracketed line indicates that the link is attached to a particular content item within the document.</p><p>The two view modes are each different renditions of documents and linkages. Both view modes convey different information about the connections among documents at different levels of detail. The zoomed-out view is at the level of the collection, and the zoomed-in view is at the level of the document. The zoomed-out view is a network diagram using a node-link model. All documents are viewed in relation to each other, conveying information about the size of each document (node size) and the number of links (line thickness). Functioning as an infographic, it allows understanding a lot of information at a glance. In zoomed-in view, the selected document is viewed in more detail, conveying information about the type of connections to/from that document.</p><p>Switching view modes involves transition animations suggesting the movement of zooming in and out on documents. While in zoomed-in view, opening a linked document by selecting one of its aliases also brings about a transition animation, moving laterally. Additionally, a location frame shows the open document as an active node seen from the zoomed-out perspective, which supports orientation. Additionally, documents and links can be filtered so that only a subset of the docuverse is in view.</p><p>Nexae has been designed as a closed system (i.e., with no external links) because, in order to have direct access to a linked document, it must exist in the Nexae docuverse. Similarly, aliases of linked documents and for links to point to particular parts of a document rely on that document existing in the Nexae docuverse.</p><p>This project is a small step toward a docuverse enabling new ways of mapping and accessing the interconnective structure of documents in the context of an online document system.</p><p>The proposed next steps in that larger process involve determining the technical implementation and:</p><ul>  <li>developing an edit mode with a time dimension;</li>  <li>extending the filtering technique;</li>  <li>developing a feature allowing the arrangement of documents to produce different renditions based on metadata;</li>  <li>developing a feature for overlapping links;</li>  <li>and extending the closed system.</li></ul><p>These features would bring the prototype to a functional stage and could then be used for objectives such as:</p><ul>  <li>finding the advantages and challenges in:    <ul>      <li>the bottom-up approach in creating taxonomies (instead of the top-down approach of hierarchical systems);</li>      <li>sharing taxonomies;</li>      <li>filtering as a technique for dealing with the complexity of information;</li>    </ul>  </li></ul><p>%%and explain what it brings to navigating documents. In two sentences, what does the bottom-up approach bring? What do you intend to achieve with it? what would it potentially bring?%%</p><p>%%Some concepts and practices derived from paper documents — particularly embedded information in the form of concepts such as footnotes — have been abandoned. The hierarchical organization of documents and content items has been reworked around the conception of documents as modular. In abandoning the hierarchical structure of the file system, a more flexible mechanism for categorization has been implemented, namely the common usage of hashtags, allowing a document and links to belong to multiple categories. Other abandoned concepts derived from paper documents include the clipboard and the related copy/paste method.%%</p>",
            "url": "/forking_the_docuverse_weblog/17",
            
            
            
            
            
            "date_published": "2022-04-27T00:00:00+02:00",
            "date_modified": "2022-04-27T00:00:00+02:00",
            
                "author": 
                "Rebecca Rui"
                
            
        },
    
        {
            "id": "/forking_the_docuverse_weblog/16",
            "title": "Prototype: Revisions",
            "summary": null,
            "content_text": "Additions and alterations:  Thicker lines in location frame.  Updated content in documents.  Addition of a filter menu.Interactive PrototypeDiscarded AttemptsFilter Menu",
            "content_html": "<p>Additions and alterations:</p><ul>  <li>Thicker lines in location frame.</li>  <li>Updated content in documents.</li>  <li>Addition of a filter menu.</li></ul><h2 id=\"interactive-prototype\">Interactive Prototype</h2><iframe style=\"border: 2px solid rgba(0, 0, 0, 0.1)\" width=\"640\" height=\"480\" src=\"https://framer.com/embed/Round-06--hDt0qsaq8QlB3oLigjRr/F_MbbVHe7?highlights=0\" allowfullscreen=\"\"></iframe><h2 id=\"discarded-attempts\">Discarded Attempts</h2><h3 id=\"filter-menu\">Filter Menu</h3><p><img src=\"assets/filterpanel_01.png\" alt=\"\" /></p>",
            "url": "/forking_the_docuverse_weblog/16",
            
            
            
            
            
            "date_published": "2022-03-25T00:00:00+01:00",
            "date_modified": "2022-03-25T00:00:00+01:00",
            
                "author": 
                "Rebecca Rui"
                
            
        },
    
        {
            "id": "/forking_the_docuverse_weblog/15",
            "title": "Prototype: Revising the Location Frame and Transition Animations",
            "summary": null,
            "content_text": "Redesign of the Location FrameIn the previous version of the location frame, traversing documents meant that movement was animated both in the main frame and the location frame.In this version, all documents are displayed in the location frame and the movement is animated through change in link color and node brightness.The brightest document is the one that is active (i.e., open), and the purple links indicate the inactive (linked documents).Transition Animations: Spawning Alias DocumentsThe animation of the links now split into separate links as multiple aliases spawn.Addition of a LegendThe legend provides information about the various link types, which is accessible through the info icon in the bottom left corner.Addition of a Metadata WindowInteractive PrototypeDiscarded AttemptsIndicating the Active Document and the Inactive (Linked) Documents",
            "content_html": "<h3 id=\"redesign-of-the-location-frame\">Redesign of the Location Frame</h3><p>In the previous version of the location frame, traversing documents meant that movement was animated both in the main frame and the location frame.</p><p><img src=\"assets/round_06_location_frame_from_round_5.gif\" alt=\"\" /></p><p><img src=\"assets/round_06_location_frame_new.gif\" alt=\"\" /></p><p>In this version, all documents are displayed in the location frame and the movement is animated through change in link color and node brightness.</p><p><img src=\"assets/LocationFrame.png\" alt=\"\" /></p><p>The brightest document is the one that is active (i.e., open), and the purple links indicate the inactive (linked documents).</p><!-- ### Indicating the Active Document and the Inactive (Linked) Documents --><h3 id=\"transition-animations-spawning-alias-documents\">Transition Animations: Spawning Alias Documents</h3><p>The animation of the links now split into separate links as multiple aliases spawn.</p><p><img src=\"assets/round_06_alias_split.gif\" alt=\"\" /></p><h3 id=\"addition-of-a-legend\">Addition of a Legend</h3><p>The legend provides information about the various link types, which is accessible through the info icon in the bottom left corner.</p><p><img src=\"assets/legend.png\" alt=\"\" /></p><h3 id=\"addition-of-a-metadata-window\">Addition of a Metadata Window</h3><p><img src=\"assets/metadata.png\" alt=\"\" /></p><h2 id=\"interactive-prototype\">Interactive Prototype</h2><iframe style=\"border: 2px solid rgba(0, 0, 0, 0.1)\" width=\"640\" height=\"480\" src=\"https://framer.com/embed/Round-06--hiw1G3EWg9PAMWVgCcWf/F_MbbVHe7?highlights=0\" allowfullscreen=\"\"></iframe><h2 id=\"discarded-attempts\">Discarded Attempts</h2><h3 id=\"indicating-the-active-document-and-the-inactive-linked-documents\">Indicating the Active Document and the Inactive (Linked) Documents</h3><p><img src=\"assets/round_06_(in)active_black.gif\" alt=\"\" /></p><p><img src=\"assets/round_06_(in)active_gray.gif\" alt=\"\" /></p><p><img src=\"assets/round_06_(in)active_purple.gif\" alt=\"\" /></p><p><img src=\"assets/round_06_(in)active_red.gif\" alt=\"\" /></p><p><img src=\"assets/round_06_active_pink.gif\" alt=\"\" /></p><p><img src=\"assets/round_06_active_teal.gif\" alt=\"\" /></p>",
            "url": "/forking_the_docuverse_weblog/15",
            
            
            
            
            
            "date_published": "2022-02-24T00:00:00+01:00",
            "date_modified": "2022-02-24T00:00:00+01:00",
            
                "author": 
                "Rebecca Rui"
                
            
        },
    
        {
            "id": "/forking_the_docuverse_weblog/14",
            "title": "Concept Design and Prototype: Revising Links and Aliases",
            "summary": null,
            "content_text": "Alterations and additions:  Redesign of links to distinguish:          Link direction      Link endpoint (by improving the design of the brackets)        Added a legend (a list of the icons and symbols).  Color coding:          Title underline is replaced with border color.        Added a location frame (showing Inventory View) while in Lateral View.  Aliases no longer have expand icons but use brightness to indicate that it can be triggered to open the linked document.  Minimize icon is replaced by a node-link icon, triggering the movement from Lateral View to Inventory View.Visual Distinction of Links: Link Type, Link Direction, Link EndpointLink types: Transclusion, sequence link, and tag link.Link direction: To or from one document and another.Link endpoints: Distinguishing between a link that points to an entire document and a link that points to a particular part of a document.Examples of different link types, directions, and endpoints are seen in the image below.Links are visualized as a single element separate from the label.The image below shows what it would look like if multiple labels were attached to a tag link.Switching View ModesThe expand icon is replaced with a node-link icon, which triggers the movement from Lateral View to Inventory View.Traversing Documents in Lateral View Using the Location FrameRedesign of AliasesThe expand icons are removed, and now the brightness and change of cursor indicate that clicking an alias will open the linked document. The addition of an ellipsis indicates that the aliases only reveal part of the linked document.Interactive PrototypeTraverse documents in the interactive prototype below.Improvements Due  In Lateral View:          Hovering a preview should bring that preview to the front.      Hovering linked text (or preview) should result in active-color linked text.      Visualization of multiple links to/from the same content item.        Filter menu  Color-coding needs improvement.          As noted in the previous entry, there are only so many distinct colors. A two-color system can be applied. One active color for the open document and an inactive color for the aliases (displayed in the location frame as well).      Discarded AttemptsLocation Frame TransitionsVisual Distinction of LinksPosition and AlignmentIn the image below, in addition to the left-bracket link, the title, the link, the label, and the linked text are aligned to emphasize that it points from the entire document on the left to a particular part in the document on the right.In the image below, the label is placed close to the linked text within the open document.Design of Brackets",
            "content_html": "<p>Alterations and additions:</p><ul>  <li>Redesign of links to distinguish:    <ul>      <li>Link direction</li>      <li>Link endpoint (by improving the design of the brackets)</li>    </ul>  </li>  <li>Added a legend (a list of the icons and symbols).</li>  <li>Color coding:    <ul>      <li>Title underline is replaced with border color.</li>    </ul>  </li>  <li>Added a location frame (showing Inventory View) while in Lateral View.</li>  <li>Aliases no longer have expand icons but use brightness to indicate that it can be triggered to open the linked document.</li>  <li>Minimize icon is replaced by a node-link icon, triggering the movement from Lateral View to Inventory View.</li></ul><h2 id=\"visual-distinction-of-links-link-type-link-direction-link-endpoint\">Visual Distinction of Links: Link Type, Link Direction, Link Endpoint</h2><p><strong>Link types</strong>: <em>Transclusion</em>, <em>sequence link</em>, and <em>tag link</em>.</p><p><strong>Link direction</strong>: To or from one document and another.</p><p><strong>Link endpoints</strong>: Distinguishing between a link that points to an entire document and a link that points to a particular part of a document.</p><p>Examples of different link types, directions, and endpoints are seen in the image below.</p><p><img src=\"assets/link_type_direction_endpoint.png\" alt=\"\" /></p><p>Links are visualized as a single element separate from the label.</p><p><img src=\"assets/link_endpoint_one_tag.png\" alt=\"\" /></p><p>The image below shows what it would look like if multiple labels were attached to a tag link.</p><p><img src=\"assets/link_endpoint_three_tags.png\" alt=\"\" /></p><h2 id=\"switching-view-modes\">Switching View Modes</h2><p>The expand icon is replaced with a node-link icon, which triggers the movement from Lateral View to Inventory View.</p><p><img src=\"assets/round_5_expand_icon 1.png\" alt=\"\" /></p><p><img src=\"assets/round_5_node-link_icon.png\" alt=\"\" /></p><p><img src=\"assets/round_05_icon.gif\" alt=\"\" /></p><h2 id=\"traversing-documents-in-lateral-view-using-the-location-frame\">Traversing Documents in Lateral View Using the Location Frame</h2><p><img src=\"assets/test_5_jump_transition_3.gif\" alt=\"\" /></p><h2 id=\"redesign-of-aliases\">Redesign of Aliases</h2><p>The expand icons are removed, and now the brightness and change of cursor indicate that clicking an alias will open the linked document. The addition of an ellipsis indicates that the aliases only reveal part of the linked document.</p><p><img src=\"assets/round_5_alias_documents.gif\" alt=\"\" /></p><h2 id=\"interactive-prototype\">Interactive Prototype</h2><p>Traverse documents in the interactive prototype below.</p><iframe style=\"border: 2px solid rgba(0, 0, 0, 0.1)\" width=\"640\" height=\"480\" src=\"https://framer.com/embed/Round-05--oM7xWmEceylTGDzxjPPZ/F_MbbVHe7?highlights=0\" allowfullscreen=\"\"></iframe><h2 id=\"improvements-due\">Improvements Due</h2><ul>  <li>In Lateral View:    <ul>      <li>Hovering a preview should bring that preview to the front.</li>      <li>Hovering linked text (or preview) should result in active-color linked text.</li>      <li>Visualization of multiple links to/from the same content item.</li>    </ul>  </li>  <li>Filter menu</li>  <li>Color-coding needs improvement.    <ul>      <li>As noted in the <a href=\"13\">previous entry</a>, there are only so many distinct colors. A two-color system can be applied. One active color for the open document and an inactive color for the aliases (displayed in the location frame as well).</li>    </ul>  </li></ul><h2 id=\"discarded-attempts\">Discarded Attempts</h2><h3 id=\"location-frame-transitions\">Location Frame Transitions</h3><p><img src=\"assets/test_5_jump_transition_1.gif\" alt=\"\" /></p><p><img src=\"assets/test_5_jump_transition_2.gif\" alt=\"\" /></p><h3 id=\"visual-distinction-of-links\">Visual Distinction of Links</h3><p><strong>Position and Alignment</strong></p><p>In the image below, in addition to the left-bracket link, the title, the link, the label, and the linked text are aligned to emphasize that it points from the entire document on the left to a particular part in the document on the right.</p><p><img src=\"assets/link_endpoint.gif\" alt=\"\" /></p><p>In the image below, the label is placed close to the linked text within the open document.</p><p><img src=\"assets/link_vis_1.png\" alt=\"\" /></p><p><strong>Design of Brackets</strong></p><p><img src=\"assets/link_bracket_1.png\" alt=\"\" /></p><p><img src=\"assets/link_bracket_2.png\" alt=\"\" /></p><p><img src=\"assets/link_bracket_3.png\" alt=\"\" /></p><p><img src=\"assets/link_bracket_4.png\" alt=\"\" /></p><p><img src=\"assets/link_bracket_5.png\" alt=\"\" /></p><p><img src=\"assets/link_bracket_6.png\" alt=\"\" /></p><p><img src=\"assets/link_bracket_7.png\" alt=\"\" /></p><p><img src=\"assets/link_bracket_8.png\" alt=\"\" /></p><p><img src=\"assets/link_bracket_9.png\" alt=\"\" /></p>",
            "url": "/forking_the_docuverse_weblog/14",
            
            
            
            
            
            "date_published": "2022-01-06T00:00:00+01:00",
            "date_modified": "2022-01-06T00:00:00+01:00",
            
                "author": 
                "Rebecca Rui"
                
            
        },
    
        {
            "id": "/forking_the_docuverse_weblog/13",
            "title": "Prototype: Visually Distinguishing Links and Indicating Multiple Aliases of the Same Document (Continued)",
            "summary": null,
            "content_text": "Alterations and additions:  Metadata of documents accessible through the ellipsis icon.  Title underline is chosen over border color.This entry is a continuation of entry 11 showcasing an interactive prototype allowing traversing documents in Inventory View and Lateral View.Interactive PrototypeReflection  To indicate multiple aliases of the same document, the title underline is deemed too subtle.          Color-coded borders might be better suited.1      The color-coded borders should also appear upon hovering a document in Inventory View for coherency.      Improvements Due  Apply color-coded borders  While in Lateral View, create a frame showing an overview of the current location in Inventory View.  Apply sequence links at the top and bottom of open documents.  Visually distinguish link direction.  Improve visualization of link endpoints.Endnotes            Though once there are more documents, it will be difficult to distinguish them by their color since there are not that many distinct colors. &#8617;      ",
            "content_html": "<p>Alterations and additions:</p><ul>  <li>Metadata of documents accessible through the ellipsis icon.</li>  <li>Title underline is chosen over border color.</li></ul><p>This entry is a continuation of <a href=\"11\">entry 11</a> showcasing an interactive prototype allowing traversing documents in Inventory View and Lateral View.</p><h2 id=\"interactive-prototype\">Interactive Prototype</h2><iframe style=\"border: 2px solid rgba(0, 0, 0, 0.1)\" width=\"640\" height=\"480\" src=\"https://framer.com/embed/Round-04--dHgNWv9LinqxHeYEk1er/F_MbbVHe7?highlights=0\" allowfullscreen=\"\"></iframe><h2 id=\"reflection\">Reflection</h2><ul>  <li>To indicate multiple aliases of the same document, the title underline is deemed too subtle.    <ul>      <li>Color-coded borders might be better suited.<sup id=\"fnref:color_code_problem\" role=\"doc-noteref\"><a href=\"#fn:color_code_problem\" class=\"footnote\" rel=\"footnote\">1</a></sup></li>      <li>The color-coded borders should also appear upon hovering a document in Inventory View for coherency.</li>    </ul>  </li></ul><h2 id=\"improvements-due\">Improvements Due</h2><ul>  <li>Apply color-coded borders</li>  <li>While in Lateral View, create a frame showing an overview of the current location in Inventory View.</li>  <li>Apply <em>sequence links</em> at the top and bottom of open documents.</li>  <li>Visually distinguish link direction.</li>  <li>Improve visualization of link endpoints.</li></ul><h1 id=\"endnotes\">Endnotes</h1><div class=\"footnotes\" role=\"doc-endnotes\">  <ol>    <li id=\"fn:color_code_problem\" role=\"doc-endnote\">      <p>Though once there are more documents, it will be difficult to distinguish them by their color since there are not that many distinct colors. <a href=\"#fnref:color_code_problem\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>  </ol></div>",
            "url": "/forking_the_docuverse_weblog/13",
            
            
            
            
            
            "date_published": "2021-12-16T00:00:00+01:00",
            "date_modified": "2021-12-16T00:00:00+01:00",
            
                "author": 
                "Rebecca Rui"
                
            
        },
    
        {
            "id": "/forking_the_docuverse_weblog/12",
            "title": "Reflection: Mapping Multisequence Text Structures",
            "summary": null,
            "content_text": "Mapping text structure can be done by both the reader and writer of documents.1 Establishing links between documents or attaching metadata to documents (assigning categories) results in multisequential text structures, or “interconnective structure[s]” (Nelson 1987). There may be an intended paragraph-by-paragraph sequence of a text — the structure conventionally conceived as the main text — but several other structures can be mapped. For example, the order of chapters and subchapters is the sequential order intended by the writer. However, within that sequential order, there can be reused content items from other sources or other categories of information (conventionally embedded and visually distinguished from the main text) that point to internal or external content items. Mapping text structure thus entails assigning the contents of documents resulting in an order that is multisequential.  It should be noted, furthermore, that while a novel on paper is far from being automatically linear, a hypertext is not necessarily nonlinear. The pages or segments may be rigorously sequential, forcing the reader to read them in a fixed order, one even more fixed than that of the pages of a book, because it is always possible to open a book to any page one wishes while a hypertext can be programmed to totally control the reader’s path. This said, hypertext by nature lends itself ideally to a variety of reading paths and to multisequential navigation. (Vandendorpe 2009)The design of the construct should facilitate mapping text structures multisequentially and the choice of showing/hiding particular paths, including the fixed sequence set by a writer. To that end, a third link type called sequence links needs to be developed.2SourcesVandendorpe C. From papyrus to hypertext: toward the universal digital library. Urbana: University of Illinois Press; 2009.            As noted in entry 03, computational methods, such as applying natural language processing techniques for classifying text and keyword extraction, are not excluded. &#8617;              Sequence links are introduced in entry 14. &#8617;      ",
            "content_html": "<p>Mapping text structure can be done by both the reader and writer of documents.<sup id=\"fnref:computational_methods\" role=\"doc-noteref\"><a href=\"#fn:computational_methods\" class=\"footnote\" rel=\"footnote\">1</a></sup> Establishing links between documents or attaching metadata to documents (assigning categories) results in multisequential text structures, or “interconnective structure[s]” (Nelson 1987). There may be an intended paragraph-by-paragraph sequence of a text — the structure conventionally conceived as the main text — but several other structures can be mapped. For example, the order of chapters and subchapters is the sequential order intended by the writer. However, within that sequential order, there can be reused content items from other sources or other categories of information (conventionally embedded and visually distinguished from the main text) that point to internal or external content items. Mapping text structure thus entails assigning the contents of documents resulting in an order that is multisequential.</p><blockquote>  <p>It should be noted, furthermore, that while a novel on paper is far from being automatically linear, a hypertext is not necessarily nonlinear. The pages or segments may be rigorously sequential, forcing the reader to read them in a fixed order, one even more fixed than that of the pages of a book, because it is always possible to open a book to any page one wishes while a hypertext can be programmed to totally control the reader’s path. This said, hypertext by nature lends itself ideally to a variety of reading paths and to multisequential navigation. (Vandendorpe 2009)</p></blockquote><p>The design of the construct should facilitate mapping text structures multisequentially and the choice of showing/hiding particular paths, including the fixed sequence set by a writer. To that end, a third link type called <em>sequence links</em> needs to be developed.<sup id=\"fnref:sequence_link\" role=\"doc-noteref\"><a href=\"#fn:sequence_link\" class=\"footnote\" rel=\"footnote\">2</a></sup></p><h2 id=\"sources\">Sources</h2><p>Vandendorpe C. From papyrus to hypertext: toward the universal digital library. Urbana: University of Illinois Press; 2009.</p><div class=\"footnotes\" role=\"doc-endnotes\">  <ol>    <li id=\"fn:computational_methods\" role=\"doc-endnote\">      <p>As noted in <a href=\"03\">entry 03</a>, computational methods, such as applying natural language processing techniques for classifying text and keyword extraction, are not excluded. <a href=\"#fnref:computational_methods\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>    <li id=\"fn:sequence_link\" role=\"doc-endnote\">      <p><em>Sequence links</em> are introduced in <a href=\"14\">entry 14</a>. <a href=\"#fnref:sequence_link\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>  </ol></div>",
            "url": "/forking_the_docuverse_weblog/12",
            
            
            
            
            
            "date_published": "2021-12-12T00:00:00+01:00",
            "date_modified": "2021-12-12T00:00:00+01:00",
            
                "author": 
                "Rebecca Rui"
                
            
        },
    
        {
            "id": "/forking_the_docuverse_weblog/11",
            "title": "Prototype: Visually Distinguishing Links and Indicating Multiple Aliases of the Same Document",
            "summary": null,
            "content_text": "In this entry, the components of Lateral View are revised. The main challenges involve color coding and how cursor events change the display states of different categories of information. Those different categories of information are:  Link endpoints: whether a link points to an entire document or a content item within a document.  Multiple aliases of the same document.  Link direction.  Link type; whether it is a transclusion or tag link.  Tag link labels.Questions are:  How should these components be visualized?  When should these components be shown or hidden?  How should these components animate between a shown and hidden state?Link EndpointsTo distinguish between a link that points to an entire document or a content item within a document, the link’s endpoint is either bracketed or pointed, respectively. Additionally, if a link points to a content item within a document, the linked content is emphasized, and if a link points to an entire document, its title is emphasized. These distinctions are demonstrated in the image below.Multiple Aliases of the Same DocumentIn designing Lateral View, one of the challenges is how to indicate that there are multiple aliases of the same document. Below are variations of applying a color code.Verison 1In version 1, linked content items share the same color.In the top-left corner in the image above, the blue color-coding and shape of the link indicate that the word “modality” in the middle document is linked to the entire side document. In the bottom-right of the image, the green color coding and shape of the link indicate that only parts of each document are linked.1Verison 2A color-coded border around the side previews is applied in version 2, as seen in the image below. All linked content is gray, including the links.Verison 3A more subtle approach is taken in version 3, having underlined titles. Additionally, all linked content items are purple, while navigation icons remain gray, indicating two distinct categories of information.Link TypesIn the two images below, the version with the colored border is compared to the version with the underlined title. In both cases, the dashed line indicates a transclusion type link, and the solid line indicates a tag link.Position and Visualization of Tag Link LabelsIn the examples below, the tag link points from a particular content item of the open document (middle) to the entire side document. Specifically, the word modality is linked to the entire document titled Defining Modality and Medium. The direction of the tag link is visually indicated by the label Definition. The three images below show variations of the position of the label.In the image above, while not hovering shows whether the link points to a particular content item within a document or the entire document. While hovering shows the label combined with the link direction.In the image above, all information categories are shown while not hovering. Only the display state of the expand icon is toggled on the two different cursor events.In the image above, while not hovering shows whether the link points to a particular content item within a document or the entire document, and while hovering hides the previous information and shows the label combined with the link direction.Interactive PrototypeDiscarded AttemptsAs seen below, one of the problems with the color border is the awkward transition animation effects.Other variations of the color-coding system are seen in the following images.            It may become distracting to have multiple colors throughout the main document. &#8617;      ",
            "content_html": "<p>In this entry, the components of Lateral View are revised. The main challenges involve color coding and how cursor events change the display states of different categories of information. Those different categories of information are:</p><ol>  <li>Link endpoints: whether a link points to an entire document or a content item within a document.</li>  <li>Multiple aliases of the same document.</li>  <li>Link direction.</li>  <li>Link type; whether it is a transclusion or tag link.</li>  <li>Tag link labels.</li></ol><p>Questions are:</p><ul>  <li>How should these components be visualized?</li>  <li>When should these components be shown or hidden?</li>  <li>How should these components animate between a shown and hidden state?</li></ul><h2 id=\"link-endpoints\">Link Endpoints</h2><p>To distinguish between a link that points to an entire document or a content item within a document, the link’s endpoint is either bracketed or pointed, respectively. Additionally, if a link points to a content item within a document, the linked content is emphasized, and if a link points to an entire document, its title is emphasized. These distinctions are demonstrated in the image below.</p><p><img src=\"assets/document_to_document_links.png\" alt=\"\" /></p><h2 id=\"multiple-aliases-of-the-same-document\">Multiple Aliases of the Same Document</h2><p>In designing Lateral View, one of the challenges is how to indicate that there are multiple aliases of the same document. Below are variations of applying a color code.</p><p><strong>Verison 1</strong></p><p>In version 1, linked content items share the same color.</p><p><img src=\"assets/coded_colors.png\" alt=\"\" /></p><p>In the top-left corner in the image above, the blue color-coding and shape of the link indicate that the word “modality” in the middle document is linked to the entire side document. In the bottom-right of the image, the green color coding and shape of the link indicate that only parts of each document are linked.<sup id=\"fnref:version_1\" role=\"doc-noteref\"><a href=\"#fn:version_1\" class=\"footnote\" rel=\"footnote\">1</a></sup></p><p><strong>Verison 2</strong></p><p>A color-coded border around the side previews is applied in version 2, as seen in the image below. All linked content is gray, including the links.</p><p><img src=\"assets/coded_gray.png\" alt=\"\" /></p><p><strong>Verison 3</strong></p><p>A more subtle approach is taken in version 3, having underlined titles. Additionally, all linked content items are purple, while navigation icons remain gray, indicating two distinct categories of information.</p><p><img src=\"assets/coded_underline.png\" alt=\"\" /></p><h2 id=\"link-types\">Link Types</h2><p>In the two images below, the version with the colored border is compared to the version with the underlined title. In both cases, the dashed line indicates a transclusion type link, and the solid line indicates a tag link.</p><p><img src=\"assets/document_color_border.png\" alt=\"\" /></p><p><img src=\"assets/document_color_underline.png\" alt=\"\" /></p><h2 id=\"position-and-visualization-of-tag-link-labels\">Position and Visualization of Tag Link Labels</h2><p>In the examples below, the tag link points from a particular content item of the open document (middle) to the entire side document. Specifically, the word <em>modality</em> is linked to the entire document titled <em>Defining Modality and Medium</em>. The direction of the tag link is visually indicated by the label <em>Definition</em>. The three images below show variations of the position of the label.</p><p><img src=\"assets/label_position_01.gif\" alt=\"\" /></p><p>In the image above, <strong>while not hovering</strong> shows whether the link points to a particular content item within a document or the entire document. <strong>While hovering</strong> shows the label combined with the link direction.</p><p><img src=\"assets/label_position_02.gif\" alt=\"\" /></p><p>In the image above, all information categories are shown <strong>while not hovering</strong>. Only the display state of the <em>expand</em> icon is toggled on the two different cursor events.</p><p><img src=\"assets/label_position_03.gif\" alt=\"\" /></p><p>In the image above, <strong>while not hovering</strong> shows whether the link points to a particular content item within a document or the entire document, and <strong>while hovering</strong> hides the previous information and shows the label combined with the link direction.</p><h2 id=\"interactive-prototype\">Interactive Prototype</h2><iframe style=\"border: 2px solid rgba(0, 0, 0, 0.1)\" width=\"640\" height=\"480\" src=\"https://framer.com/embed/Round-04--dHgNWv9LinqxHeYEk1er/wPcAT4up3?highlights=0\" allowfullscreen=\"\"></iframe><h2 id=\"discarded-attempts\">Discarded Attempts</h2><p>As seen below, one of the problems with the color border is the awkward transition animation effects.</p><p><img src=\"assets/test_04_transition_01.gif\" alt=\"\" /></p><p>Other variations of the color-coding system are seen in the following images.</p><p><img src=\"assets/label_color_coding_black_outline.png\" alt=\"\" /></p><div class=\"footnotes\" role=\"doc-endnotes\">  <ol>    <li id=\"fn:version_1\" role=\"doc-endnote\">      <p>It may become distracting to have multiple colors throughout the main document. <a href=\"#fnref:version_1\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>  </ol></div>",
            "url": "/forking_the_docuverse_weblog/11",
            
            
            
            
            
            "date_published": "2021-12-08T00:00:00+01:00",
            "date_modified": "2021-12-08T00:00:00+01:00",
            
                "author": 
                "Rebecca Rui"
                
            
        },
    
        {
            "id": "/forking_the_docuverse_weblog/10",
            "title": "Concept Design and Prototype: Representing Linked Documents as Aliases",
            "summary": null,
            "content_text": "Alterations and additions:  Lateral Mode renamed Lateral View  Redesign of Lateral View          The preview icons (seen in a previous entry) are now aliases positioned on the sides of the open document.      Only one document can be open, positioned in the middle.      In this entry, one document is the main document, and its linked documents are represented as aliases.Opening DocumentsInventory ViewThe image below shows how to open a document in Inventory View to enter Lateral View.Lateral ViewWhile in Lateral View, it is possible to open the linked documents. Note that each linked content item can be of the same document, in which case there are multiple aliases of the same document (in the example below, document 1).AliasesThe aliases display the particular linked content item (i.e., inactive) on the side of the open document. In the example below, there are two tag links and one transclusion.Upon hovering on a link, the alias comes into view (i.e., active) together with the #Label of the tag link.Interactive PrototypeThe interactive prototypes below explore how to indicate active and inactive states and how to animate multiple aliases of the same document.Active/Inactive AliasesTwo versions of aliases are shown below.Color Code VersionOpacity VersionAnimating Multiple Aliases of the Same DocumentIf the open document has several links to the same document, then that document has multiple aliases. In the first image below, the multiple aliases appear before a document is open, and in the second image, aliases appear after the middle document is open.",
            "content_html": "<p>Alterations and additions:</p><ul>  <li>Lateral Mode renamed Lateral View</li>  <li>Redesign of Lateral View    <ul>      <li>The preview icons (seen in a <a href=\"08\">previous entry</a>) are now aliases positioned on the sides of the open document.</li>      <li>Only one document can be open, positioned in the middle.</li>    </ul>  </li></ul><p>In this entry, one document is the main document, and its linked documents are represented as aliases.</p><h2 id=\"opening-documents\">Opening Documents</h2><p><strong>Inventory View</strong></p><p>The image below shows how to open a document in Inventory View to enter Lateral View.</p><p><img src=\"assets/inventory_to_lateral.png\" alt=\"\" /></p><p><strong>Lateral View</strong></p><p>While in Lateral View, it is possible to open the linked documents. Note that each linked content item can be of the same document, in which case there are multiple aliases of the same document (in the example below, document 1).</p><p><img src=\"assets/lateral_view_opening_documents.png\" alt=\"\" /></p><h2 id=\"aliases\">Aliases</h2><p>The aliases display the particular linked content item (i.e., inactive) on the side of the open document. In the example below, there are two tag links and one transclusion.</p><p><img src=\"assets/lateral_mode_01.png\" alt=\"\" /></p><p>Upon hovering on a link, the alias comes into view (i.e., active) together with the #Label of the tag link.</p><p><img src=\"assets/lateral_mode_02.png\" alt=\"\" /></p><h2 id=\"interactive-prototype\">Interactive Prototype</h2><p>The interactive prototypes below explore how to indicate active and inactive states and how to animate multiple aliases of the same document.</p><h3 id=\"activeinactive-aliases\">Active/Inactive Aliases</h3><p>Two versions of aliases are shown below.</p><p><strong>Color Code Version</strong></p><p><img src=\"assets/test_03_color.gif\" alt=\"\" /></p><p><strong>Opacity Version</strong></p><p><img src=\"assets/test_03_opacity.gif\" alt=\"\" /></p><h3 id=\"animating-multiple-aliases-of-the-same-document\">Animating Multiple Aliases of the Same Document</h3><p>If the open document has several links to the same document, then that document has multiple aliases. In the first image below, the multiple aliases appear before a document is open, and in the second image, aliases appear after the middle document is open.</p><p><img src=\"assets/test_03_split_before.gif\" alt=\"\" /></p><p><img src=\"assets/test_03_split_after.gif\" alt=\"\" /></p>",
            "url": "/forking_the_docuverse_weblog/10",
            
            
            
            
            
            "date_published": "2021-11-26T00:00:00+01:00",
            "date_modified": "2021-11-26T00:00:00+01:00",
            
                "author": 
                "Rebecca Rui"
                
            
        },
    
        {
            "id": "/forking_the_docuverse_weblog/09",
            "title": "Reflection: Representing Linked Documents",
            "summary": null,
            "content_text": "Ted Nelson envisioned the docuverse implemented with bi-directional visual links that have been explored in many models and prototypes:Transcluded from Nelson (1965)Transcluded from Nelson (1987)Transcluded from Nelson (2015)Transcluded from Nelson (1999)Screenshot of Xanadoc (try the interactive demo here)Transcluded from Nelson (2016)As discussed in a previous entry, working with documents side-by-side and visual links is beneficial. One of the benefits is that content included in one document from another (i.e., transclusion) is directly and visually available for cross-examination. Direct access to the original context enables the ability to assess whether the meaning conveyed in the original document has been misconstrued in other documents. On the Web, links are one-directional, and the linked documents (if at all) take the form of previews (of the web page, not a particular content item)1 as the cursor hovers on a hyperlink.Screenshot of WikipediaAn improvement would be landing at the particular linked part of a document:As has been explored in the interactive prototypes so far, some issues come with visual links between documents, mainly having to do with the complexity of information as various links crisscross each other. Several ideas for dealing with that complexity have been explored, some of which have been implemented as prototypes:LayersExpandable gridsModular hierarchical blocks linked non-hierarchicallyLayout inspired by concept mapsSets of sequential content items (re)arranged in a stackApplying tags to links and documentsIn the previous entry, the possibility to apply #Labels to tag links (and document metadata) in order to filter information was introduced, which is deemed useful, particularly in Inventory View. However, in Lateral Mode, the crisscrossing visual links between documents is potentially distracting and does not make interacting with the connections manageable. In the previous entry, the proposed solution took the form of preview icons that are only visible on deliberate action (i.e., as the cursor hovers a link). That proposal, however, results in the same problem as with links on the Web: the link endpoint is not seen and to view a linked document means leaving the currently open document. A new representation of linked documents (in Lateral Mode) is explored in the next entry.SourcesNelson TH. A File Structure for the Complex, the Changing, the Intermediate. 1965;13.Nelson TH. Literary Machines: The report on, and of, Project Xanadu concerning word processing, electronic publishing, hypertext, thinkertoys, tomorrow’s intellectual revolution, and certain other topics including knowledge, education and freedom. 87.1. Sausalito, California: Mindful Press; 1987.Nelson TH. Xanalogical Structure, Needed Now More than Ever: Parallel Documents, Deep Links to Content, Deep Versioning, and Deep Re-Use. ACM Computing Surveys. 1999;31(4):32.Nelson TH. What Box? In: Dechow DR, Struppa DC, editors. Intertwingled. Cham: Springer International Publishing; 2015. p. 133–50.Nelson TH. The Xanadu Universe [Internet]. 2016 [cited 2021 Oct 28]. Available from: https://xanadu.com/xUniverse-D6Endnotes            Traversing content on the Web by selecting hyperlinks commonly entails blindly jumping and landing at the top of the page: &#8617;      ",
            "content_html": "<p>Ted Nelson envisioned the docuverse implemented with bi-directional visual links that have been explored in many models and prototypes:</p><p><img src=\"assets/nelson_11-4.png\" alt=\"\" /></p><p><em>Transcluded from Nelson (1965)</em></p><p><img src=\"assets/nelson_qframe.png\" alt=\"\" /></p><p><em>Transcluded from Nelson (1987)</em></p><p><img src=\"assets/nelson_cosmicbook.png\" alt=\"\" /></p><p><em>Transcluded from Nelson (2015)</em></p><p><img src=\"assets/nelson_PYXI_transpointing_windows.png\" alt=\"\" /></p><p><em>Transcluded from Nelson (1999)</em></p><p><img src=\"assets/xanadoc.png\" alt=\"\" /></p><p><em>Screenshot of Xanadoc (try the interactive demo <a href=\"https://xanadu.com/xanademos/MoeJusteOrigins.html\">here</a>)</em></p><p><img src=\"assets/xanaduspace_2007.png\" alt=\"\" /></p><p><em>Transcluded from Nelson (2016)</em></p><p>As discussed in a <a href=\"03\">previous entry</a>, working with documents side-by-side and visual links is beneficial. One of the benefits is that content included in one document from another (i.e., transclusion) is directly and visually available for cross-examination. Direct access to the original context enables the ability to assess whether the meaning conveyed in the original document has been misconstrued in other documents. On the Web, links are one-directional, and the linked documents (if at all) take the form of previews (of the <em>web page</em>, not a particular content item)<sup id=\"fnref:links_on_the_web\" role=\"doc-noteref\"><a href=\"#fn:links_on_the_web\" class=\"footnote\" rel=\"footnote\">1</a></sup> as the cursor hovers on a hyperlink.</p><p><img src=\"assets/wikipedia_hover_preview.png\" alt=\"\" /></p><p><em>Screenshot of Wikipedia</em></p><p><img src=\"assets/hypernotes01.png\" alt=\"\" />An improvement would be landing at the particular linked part of a document:<img src=\"assets/hypernotes03.png\" alt=\"\" /></p><p>As has been explored in the interactive prototypes so far, some issues come with visual links between documents, mainly having to do with the complexity of information as various links crisscross each other. Several ideas for dealing with that complexity have been explored, some of which have been implemented as prototypes:</p><p><strong>Layers</strong></p><p><img src=\"assets/Ideas_page_28.png\" alt=\"\" /></p><p><strong>Expandable grids</strong></p><p><img src=\"assets/Ideas_page_25.png\" alt=\"\" /></p><p><strong>Modular hierarchical blocks linked non-hierarchically</strong></p><p><img src=\"assets/Ideas_page_33.png\" alt=\"\" /></p><p><img src=\"assets/Ideas_page_18.png\" alt=\"\" /></p><p><strong>Layout inspired by concept maps</strong></p><p><img src=\"assets/Ideas_page_2_cut.png\" alt=\"\" /></p><p><strong>Sets of sequential content items (re)arranged in a stack</strong></p><p><img src=\"assets/Ideas_page_29.png\" alt=\"\" /></p><p><strong>Applying tags to links and documents</strong></p><p><img src=\"assets/Ideas_page_72.png\" alt=\"\" /></p><p>In the <a href=\"08\">previous entry</a>, the possibility to apply #Labels to tag links (and document metadata) in order to filter information was introduced, which is deemed useful, particularly in Inventory View. However, in Lateral Mode, the crisscrossing visual links between documents is potentially distracting and does not make interacting with the connections manageable. In the <a href=\"08\">previous entry</a>, the proposed solution took the form of preview icons that are only visible on deliberate action (i.e., as the cursor hovers a link). That proposal, however, results in the same problem as with links on the Web: the link endpoint is not seen and to view a linked document means leaving the currently open document. A new representation of linked documents (in Lateral Mode) is explored in the <a href=\"10\">next entry</a>.</p><h2 id=\"sources\">Sources</h2><p>Nelson TH. A File Structure for the Complex, the Changing, the Intermediate. 1965;13.</p><p>Nelson TH. Literary Machines: The report on, and of, Project Xanadu concerning word processing, electronic publishing, hypertext, thinkertoys, tomorrow’s intellectual revolution, and certain other topics including knowledge, education and freedom. 87.1. Sausalito, California: Mindful Press; 1987.</p><p>Nelson TH. Xanalogical Structure, Needed Now More than Ever: Parallel Documents, Deep Links to Content, Deep Versioning, and Deep Re-Use. ACM Computing Surveys. 1999;31(4):32.</p><p>Nelson TH. What Box? In: Dechow DR, Struppa DC, editors. Intertwingled. Cham: Springer International Publishing; 2015. p. 133–50.</p><p>Nelson TH. The Xanadu Universe [Internet]. 2016 [cited 2021 Oct 28]. Available from: <a href=\"https://xanadu.com/xUniverse-D6\">https://xanadu.com/xUniverse-D6</a></p><h2 id=\"endnotes\">Endnotes</h2><div class=\"footnotes\" role=\"doc-endnotes\">  <ol>    <li id=\"fn:links_on_the_web\" role=\"doc-endnote\">      <p>Traversing content on the Web by selecting hyperlinks commonly entails blindly <em>jumping</em> and landing at the top of the page: <a href=\"#fnref:links_on_the_web\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>  </ol></div>",
            "url": "/forking_the_docuverse_weblog/09",
            
            
            
            
            
            "date_published": "2021-11-23T00:00:00+01:00",
            "date_modified": "2021-11-23T00:00:00+01:00",
            
                "author": 
                "Rebecca Rui"
                
            
        },
    
        {
            "id": "/forking_the_docuverse_weblog/08",
            "title": "Prototype: Opening Documents and Representing Linked Documents",
            "summary": null,
            "content_text": "Alterations and additions:  The possibility for filtering tag links and documents for opening documents is added.  The representation of linked documents in versions 1 and 2 demonstrated in the previous entry are discarded.          Linked documents are no longer represented as nodes in Vertical and Lateral Mode, rather as icons, of which there are two versions: preview icon and expand icon.        Transition animations are divided into steps to indicate that the links in Inventory View split into individual links in Lateral Mode.Ways of Opening DocumentsInventory View functions as an infographic-like overview of all the documents by conveying information about the size and number of links. From this overview perspective, people should somehow be able to select one or more documents to view in more detail, essentially entering a subset of the docuverse. To that end, a filtering technique is explored. It is possible to filter documents based on their metadata and filter tag links based on their labels. In addition, besides selecting a node in Inventory View to open documents, it is also possible to select links to open documents and enter Lateral View.Selecting Links to Enter Lateral ViewAs seen in the previous entry, selecting a node in Inventory View opens a single document. It is also possible to open two documents by selecting the links between them. There are two ways of opening documents by selecting links:  Double-click on links between two nodes opens the two linked documents, and all links are visible between documents.  Single-click on links between two nodes reveals a menu of the tag links. Selecting a tag link will open the two linked documents, and only the selected tag links are visible.Icons for Representing Linked Documents in Lateral ModeHovering on a link in an open document reveals the linked document. There are two versions of how to represent a linked document: an expand icon and a preview icon.Demo VideoThe video below shows how to filter links by selecting #Labels and selecting links to open documents.",
            "content_html": "<p>Alterations and additions:</p><ul>  <li>The possibility for filtering tag links and documents for opening documents is added.</li>  <li>The representation of linked documents in versions 1 and 2 demonstrated in the <a href=\"07\">previous entry</a> are discarded.    <ul>      <li>Linked documents are no longer represented as nodes in Vertical and Lateral Mode, rather as icons, of which there are two versions: preview icon and expand icon.</li>    </ul>  </li>  <li>Transition animations are divided into steps to indicate that the links in Inventory View split into individual links in Lateral Mode.</li></ul><h2 id=\"ways-of-opening-documents\">Ways of Opening Documents</h2><p>Inventory View functions as an infographic-like overview of all the documents by conveying information about the size and number of links. From this overview perspective, people should somehow be able to select one or more documents to view in more detail, essentially entering a subset of the docuverse. To that end, a filtering technique is explored. It is possible to filter documents based on their metadata and filter tag links based on their labels. In addition, besides selecting a node in Inventory View to open documents, it is also possible to select links to open documents and enter Lateral View.</p><h2 id=\"selecting-links-to-enter-lateral-view\">Selecting Links to Enter Lateral View</h2><p>As seen in the <a href=\"07\">previous entry</a>, selecting a node in Inventory View opens a single document. It is also possible to open two documents by selecting the links between them. There are two ways of opening documents by selecting links:</p><ol>  <li><strong>Double-click</strong> on links between two nodes opens the two linked documents, and all links are visible between documents.</li>  <li><strong>Single-click</strong> on links between two nodes reveals a menu of the tag links. Selecting a tag link will open the two linked documents, and only the selected tag links are visible.</li></ol><p><img src=\"assets/selecting_links.png\" alt=\"\" /></p><h2 id=\"icons-for-representing-linked-documents-in-lateral-mode\">Icons for Representing Linked Documents in Lateral Mode</h2><p>Hovering on a link in an open document reveals the linked document. There are two versions of how to represent a linked document: an expand icon and a preview icon.</p><p><img src=\"assets/preview_expand_icons.png\" alt=\"\" /></p><h2 id=\"demo-video\">Demo Video</h2><p>The video below shows how to filter links by selecting #Labels and selecting links to open documents.</p><p><img src=\"assets/export_test_02(twice_speed).gif\" alt=\"\" /></p>",
            "url": "/forking_the_docuverse_weblog/08",
            
            
            
            
            
            "date_published": "2021-11-12T00:00:00+01:00",
            "date_modified": "2021-11-12T00:00:00+01:00",
            
                "author": 
                "Rebecca Rui"
                
            
        },
    
        {
            "id": "/forking_the_docuverse_weblog/07",
            "title": "Prototype: Switching View Modes",
            "summary": null,
            "content_text": "Alterations and additions:  Stack View is abandoned due to potentially being too visually overwhelming. All view modes are now 2D.  Labels can be attached to links (called tag links)While in Inventory View, selecting a node opens a document. Selecting another node will close the already-open document and open the other. There are two versions for how this might look and work.1From Inventory View to Lateral ModeVersion 1In the image above, the linked documents are always visible and join in the middle of the open document.Version 2The image below shows an alternate version in which the linked documents are only visible when hovering on a link in the open document (called Vertical View).In both versions, if a link is selected within an open document, the corresponding document is opened, and the linked content items align (in Lateral Mode).Open/Close MechanismWhile in Lateral Mode, if another link within one of the two open documents is selected, the other document closes, and the corresponding document opens. This open/close mechanism allows traveling by links while retaining one document as the main document. The main document is always the document from which a link is selected. In the image below, the open/close mechanism is shown.Note that only the first-level linked nodes of an open document are visible in Lateral Mode. As indicated in the last step in the image above, closing a document will hide its linked nodes unless linked to one of the open documents.Lateral Mode (as in the lateral reading strategy) enables checking the original context of a transcluded content item through deliberate action. Using tag links makes it possible to filter which link types should be displayed. This means traveling by a link path is possible according to a selected tag (e.g., #comment, #elaboration, #definition).Demo VideoIn version 1, the neighboring documents are always shown, whereas in version 2, hovering on a link shows documents as nodes on the side.Version 1Version 2ReflectionIn version 2, hovering on a link to show (documents represented as) nodes in Vertical Mode is not particularly useful since the size is only informative when seen in relation to other nodes. In the next entry, the representation of linked documents is further developed.Discarded AttemptsOpening a Document in Inventory ViewIn the video below, the links are visualized as vertical lines on each side of the document. The thickness of the lines corresponds with the number of linked content items. One of the drawbacks here is that there is too much information visualized simultaneously.The video below demonstrates a slow transition from Inventory View to Vertical Mode. The question here is, what is the best way to animate a link within an open document to a closed document. In this example, hovering on a link has the effect of extending the line to the content item within the open document, and the closed document (node) scales up. A drawback is that the scaling effect does not immediately capture attention.Attempts at Visualizing Opening a Document in Vertical ModeOnce in Vertical Mode, the selected link opens the corresponding document. The question is how the linked content objects should interact. In this example, upon opening a document by selecting a link, the linked content objects align, and the links fade out. The alignment of the content items may suffice.Endnotes            This is similar to when selecting a website URL from the bookmarks library in a browser, it replaces the current open website. It is, of course, possible to open a new browser tab, however, the difference here is that the documents can be opened in the same window, and the connections are visual links. &#8617;      ",
            "content_html": "<p>Alterations and additions:</p><ul>  <li>Stack View is abandoned due to potentially being too visually overwhelming. All view modes are now 2D.</li>  <li>Labels can be attached to links (called <em>tag links</em>)</li></ul><p>While in Inventory View, selecting a node opens a document. Selecting another node will close the already-open document and open the other. There are two versions for how this might look and work.<sup id=\"fnref:browser_bookmark\" role=\"doc-noteref\"><a href=\"#fn:browser_bookmark\" class=\"footnote\" rel=\"footnote\">1</a></sup></p><h2 id=\"from-inventory-view-to-lateral-mode\">From Inventory View to Lateral Mode</h2><p><strong>Version 1</strong></p><p><img src=\"assets/bp_select_expand.png\" alt=\"\" /></p><p>In the image above, the linked documents are always visible and join in the middle of the open document.</p><p><strong>Version 2</strong></p><p>The image below shows an alternate version in which the linked documents are only visible when hovering on a link in the open document (called Vertical View).</p><p><img src=\"assets/bp_inventory_vertical_lateral.png\" alt=\"\" /></p><p>In both versions, if a link is selected within an open document, the corresponding document is opened, and the linked content items align (in Lateral Mode).</p><p><img src=\"assets/bp_inventory_to_lateral.png\" alt=\"\" /></p><h2 id=\"openclose-mechanism\">Open/Close Mechanism</h2><p>While in Lateral Mode, if another link within one of the two open documents is selected, the other document closes, and the corresponding document opens. This open/close mechanism allows traveling by links while retaining one document as the main document. The main document is always the document from which a link is selected. In the image below, the open/close mechanism is shown.</p><p><img src=\"assets/bp_vertical_to_lateral.png\" alt=\"\" /><img src=\"assets/bp_lateral_open_close.png\" alt=\"\" /></p><p>Note that only the first-level linked nodes of an open document are visible in Lateral Mode. As indicated in the last step in the image above, closing a document will hide its linked nodes unless linked to one of the open documents.</p><p>Lateral Mode (as in the lateral reading strategy) enables checking the original context of a transcluded content item through deliberate action. Using tag links makes it possible to filter which link types should be displayed. This means traveling by a link path is possible according to a selected tag (e.g., #comment, #elaboration, #definition).</p><p><img src=\"assets/bp_travel_by_links.png\" alt=\"\" /></p><h2 id=\"demo-video\">Demo Video</h2><p>In version 1, the neighboring documents are always shown, whereas in version 2, hovering on a link shows documents as nodes on the side.</p><p><strong>Version 1</strong></p><p><br /></p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/oI5o20Qpypg?controls=0\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe><p><br /></p><p><strong>Version 2</strong></p><p><br /></p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/je8Pt7bm3oA?controls=0\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe><p><br /></p><h2 id=\"reflection\">Reflection</h2><p>In version 2, hovering on a link to show (documents represented as) nodes in Vertical Mode is not particularly useful since the size is only informative when seen in relation to other nodes. In the <a href=\"08\">next entry</a>, the representation of linked documents is further developed.</p><h2 id=\"discarded-attempts\">Discarded Attempts</h2><h3 id=\"opening-a-document-in-inventory-view\">Opening a Document in Inventory View</h3><p>In the video below, the links are visualized as vertical lines on each side of the document. The thickness of the lines corresponds with the number of linked content items. One of the drawbacks here is that there is too much information visualized simultaneously.</p><p><br /></p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/mS90u173WOY\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe><p><br /></p><p>The video below demonstrates a slow transition from Inventory View to Vertical Mode. The question here is, what is the best way to animate a link within an open document to a closed document. In this example, hovering on a link has the effect of extending the line to the content item within the open document, and the closed document (node) scales up. A drawback is that the scaling effect does not immediately capture attention.</p><p><br /></p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/-fDsP9OiBDU\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe><p><br /></p><h3 id=\"attempts-at-visualizing-opening-a-document-in-vertical-mode\">Attempts at Visualizing Opening a Document in Vertical Mode</h3><p>Once in Vertical Mode, the selected link opens the corresponding document. The question is how the linked content objects should interact. In this example, upon opening a document by selecting a link, the linked content objects align, and the links fade out. The alignment of the content items may suffice.</p><p><br /></p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/5ClUV5wzWxc\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe><p><br /></p><h2 id=\"endnotes\">Endnotes</h2><div class=\"footnotes\" role=\"doc-endnotes\">  <ol>    <li id=\"fn:browser_bookmark\" role=\"doc-endnote\">      <p>This is similar to when selecting a website URL from the bookmarks library in a browser, it replaces the current open website. It is, of course, possible to open a new browser tab, however, the difference here is that the documents can be opened in the same window, and the connections are visual links. <a href=\"#fnref:browser_bookmark\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>  </ol></div>",
            "url": "/forking_the_docuverse_weblog/07",
            
            
            
            
            
            "date_published": "2021-10-17T00:00:00+02:00",
            "date_modified": "2021-10-17T00:00:00+02:00",
            
                "author": 
                "Rebecca Rui"
                
            
        },
    
        {
            "id": "/forking_the_docuverse_weblog/06",
            "title": "Concept Design: Documents, Content Items, and Link Types",
            "summary": null,
            "content_text": "The intent here is to clarify which concepts are to become components in the construct and how those components interact.Questions are:  What can documents contain?  How are links created, and which link types?A Document and Its Content ItemsA document is defined in general terms as a container of content items to which links can be attached on the level of the document and the level of the content item. The representation of a document can change in each view mode.A document can contain a single or multiple content items which may vary in modality (e.g., text, image, sound). Content items may vary in modality and may be further distinguished by type. In conventional terms, a paragraph, for example, is a content item; a quote within a paragraph is also a content item; a list and a list item are content items.Link TypesTwo main link types can be established between content items: transclusions and those that are not transclusions, called tag links which can include a descriptive label or remain empty.  Transclusion —-  Tag link –#–1. Transclusion —-A transclusion is created when a document or some of its content items are included in another document.[^excerpts] Transclusions are reused content items with visual links and thus offer a way to retrieve “the origins and context of quotations, excerpts and anthologized materials, and content transiting between versions” (Nelson 1999).The image below shows the concept of transclusion on a technical level.2. Tag link –#–Tag links are created by connecting two separate content items and can include a descriptive label (#Label) or remain empty (#). Utilizing the common usage of hashtag1 as a means to categorize content, tag links enable people to organize and filter links based on their developed taxonomy. Examples of tag links are given below.SourcesNelson TH. Xanalogical Structure, Needed Now More than Ever: Parallel Documents, Deep Links to Content, Deep Versioning, and Deep Re-Use. ACM Computing Surveys. 1999;31(4):32.Endnotes            The word hashtag refers to the symbol # (as popularized by Twitter) and combines the word hash from the hash mark and the word tag as it is used to label something belonging to a specific category. &#8617;      ",
            "content_html": "<p>The intent here is to clarify which concepts are to become components in the construct and how those components interact.</p><p>Questions are:</p><ul>  <li>What can documents contain?</li>  <li>How are links created, and which link types?</li></ul><h2 id=\"a-document-and-its-content-items\">A Document and Its Content Items</h2><p>A document is defined in general terms as a container of content items to which links can be attached on the level of the document and the level of the content item. The representation of a document can change in each view mode.</p><p>A document can contain a single or multiple content items which may vary in modality (e.g., text, image, sound). Content items may vary in modality and may be further distinguished by type. In conventional terms, a paragraph, for example, is a content item; a quote within a paragraph is also a content item; a list and a list item are content items.</p><h2 id=\"link-types\">Link Types</h2><p>Two main link types can be established between content items: transclusions and those that are not transclusions, called <em>tag links</em> which can include a descriptive label or remain empty.</p><ol>  <li><strong>Transclusion</strong> —-</li>  <li><strong>Tag link</strong> –#–</li></ol><p><img src=\"assets/link_types_01.png\" alt=\"\" /></p><h3 id=\"1-transclusion--\">1. Transclusion —-</h3><p>A transclusion is created when a document or some of its content items are included in another document.[^excerpts] Transclusions are reused content items with visual links and thus offer a way to retrieve “the origins and context of quotations, excerpts and anthologized materials, and content transiting between versions” (Nelson 1999).</p><p>The image below shows the concept of transclusion on a technical level.</p><p><img src=\"assets/link_types_02.png\" alt=\"\" /></p><h3 id=\"2-tag-link-\">2. Tag link –#–</h3><p>Tag links are created by connecting two separate content items and can include a descriptive label (#Label) or remain empty (#). Utilizing the common usage of hashtag<sup id=\"fnref:hashtag\" role=\"doc-noteref\"><a href=\"#fn:hashtag\" class=\"footnote\" rel=\"footnote\">1</a></sup> as a means to categorize content, tag links enable people to organize and filter links based on their developed taxonomy. Examples of tag links are given below.</p><p><img src=\"assets/link_types_03.png\" alt=\"\" /></p><h2 id=\"sources\">Sources</h2><p>Nelson TH. Xanalogical Structure, Needed Now More than Ever: Parallel Documents, Deep Links to Content, Deep Versioning, and Deep Re-Use. ACM Computing Surveys. 1999;31(4):32.</p><h2 id=\"endnotes\">Endnotes</h2><div class=\"footnotes\" role=\"doc-endnotes\">  <ol>    <li id=\"fn:hashtag\" role=\"doc-endnote\">      <p>The word hashtag refers to the symbol # (as popularized by Twitter) and combines the word hash from the hash mark and the word tag as it is used to label something belonging to a specific category. <a href=\"#fnref:hashtag\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>  </ol></div>",
            "url": "/forking_the_docuverse_weblog/06",
            
            
            
            
            
            "date_published": "2021-09-16T00:00:00+02:00",
            "date_modified": "2021-09-16T00:00:00+02:00",
            
                "author": 
                "Rebecca Rui"
                
            
        },
    
        {
            "id": "/forking_the_docuverse_weblog/05",
            "title": "Reflection: Components and View Modes",
            "summary": null,
            "content_text": "This entry discusses points for improving the design presented in the previous entry, particularly Stack View.Engaging With ComplexityThe purpose of Stack View is to enable the arrangement of a set of selected documents in a particular order for entering Merge View. Creating stacks is supposed to be a convenient method for engaging with complexity by selecting which to view in more detail. However, shifting from a 2D to a 3D perspective may obfuscate and not serve that purpose well. A filtering technique might be a better solution (explored in entry 08). In abandoning Stack View, proceeding first requires definitions of the basic concepts, how these concepts become components, and then how these components interact.Questions are:  What constitutes a document in the construct?  How are links attached, and how do they operate?Improvements due:  Labels should also be attached to links.See next entry.",
            "content_html": "<p>This entry discusses points for improving the design presented in the <a href=\"04\">previous entry</a>, particularly Stack View.</p><h2 id=\"engaging-with-complexity\">Engaging With Complexity</h2><p>The purpose of Stack View is to enable the arrangement of a set of selected documents in a particular order for entering Merge View. Creating stacks is supposed to be a convenient method for engaging with complexity by selecting which to view in more detail. However, shifting from a 2D to a 3D perspective may obfuscate and not serve that purpose well. A filtering technique might be a better solution (explored in <a href=\"8\">entry 08</a>). In abandoning Stack View, proceeding first requires definitions of the basic concepts, how these concepts become components, and then how these components interact.</p><p>Questions are:</p><ul>  <li>What constitutes a document in the construct?</li>  <li>How are links attached, and how do they operate?</li></ul><p>Improvements due:</p><ul>  <li>Labels should also be attached to links.</li></ul><p>See <a href=\"06\">next entry</a>.</p>",
            "url": "/forking_the_docuverse_weblog/05",
            
            
            
            
            
            "date_published": "2021-08-23T00:00:00+02:00",
            "date_modified": "2021-08-23T00:00:00+02:00",
            
                "author": 
                "Rebecca Rui"
                
            
        },
    
        {
            "id": "/forking_the_docuverse_weblog/04",
            "title": "Concept Design: Components and View Modes",
            "summary": null,
            "content_text": "View modes are different levels of perspective on documents. In addition, each view mode differs in the components used to represent a document.  Inventory View          At the level of the collection.      Documents are represented as nodes, connections as links in a two-dimensional diagram.      Displays the number of connections between documents.        Stack View          At the level of a selection of the collection.      Documents are represented as layers, connections as links in a three-dimensional stack.      Displays selection of connections (link type subcategories).        Merge View          At the level of content items.      A document is represented as a single frame (full screen).      Displays connections side-by-side or top-to-bottom.      1. Inventory ViewIn this view mode, the entire inventory is visible and represented as a diagram in which a node denotes a document and a link denotes connections of various types (specified below).NodeThe size of a node reflects the number of content items it contains (i.e., the size of the document).LinkThe thickness of a link reflects the number of links between documents.In Inventory View, it is possible to select nodes to create a stack for entering Stack View, as seen in the image above.2. Stack ViewA stack comprises a set of documents represented as layers that contain content items.StackA stack can be thought of as a workspace. The inventory in its entirety may contain complex layers of information, so creating stacks is a convenient method for engaging with complexity by selecting those to view in more detail.LayerA document is represented as a layer, which instead of having a single title, has a tag. In the image below, there are four layers: #MAIN, #A, #B, and #C.Content ItemContent items are the parts that make up a text. A content item can have any number of tags, placing it in multiple layers.Link TypesIn the image below, there are several links between the layers. As defined in the previous entry, there are two main categories of connections that cross the boundaries of documents: those that are transclusions (reused content items; inclusions of one document segment into another), and those that are not transclusions. In the image below, these two types are visually distinguished by dot-line-dot links and side-surface links.✱ These two link types must be visually distinguished, but the visual form is subject to change.The links that are not transclusions are categorized according to whichever taxonomy people wish to develop within the construct, hence the appropriation of the common usage of a hashtag as a metadata tag. For example, in the image below, if content item ID_P2 is a comment on content item ID_P1, then the layer could be tagged #COMMENTS. If the other two layers are different references, these layers could be tagged #REFERENCE_X and #REFERENCE_Y.It is also possible to display links only between a selection of layers in the stack. Upon selection, the stack is rearranged. The layers #MAIN and #COMMENTS are selected in the two images below, displaying the links between them, followed by stack rearrangement.While in Stack View, it is possible to merge all or a selection of layers. The arrangement of the stack will determine how the layers are merged.3. Merge View#MAIN and #COMMENTS are merged side by side in the image below.Only the linked content items (between #MAIN and #COMMENTS) are displayed side by side in the image below.The image below shows the option for merging the content items sequentially. If another layer were included, the order would depend on the arrangement of layers in Stack View.",
            "content_html": "<p>View modes are different levels of perspective on documents. In addition, each view mode differs in the components used to represent a document.</p><ol>  <li><strong>Inventory View</strong>    <ul>      <li>At the level of the collection.</li>      <li>Documents are represented as nodes, connections as links in a two-dimensional diagram.</li>      <li>Displays the number of connections between documents.</li>    </ul>  </li>  <li><strong>Stack View</strong>    <ul>      <li>At the level of a selection of the collection.</li>      <li>Documents are represented as layers, connections as links in a three-dimensional stack.</li>      <li>Displays selection of connections (link type subcategories).</li>    </ul>  </li>  <li><strong>Merge View</strong>    <ul>      <li>At the level of content items.</li>      <li>A document is represented as a single frame (full screen).</li>      <li>Displays connections side-by-side or top-to-bottom.</li>    </ul>  </li></ol><h2 id=\"1-inventory-view\">1. Inventory View</h2><p>In this view mode, the entire inventory is visible and represented as a diagram in which a <strong>node</strong> denotes a document and a <strong>link</strong> denotes connections of various types (specified below).</p><p><img src=\"assets/BP_01.png\" alt=\"\" /></p><p><strong>Node</strong></p><p>The size of a node reflects the number of content items it contains (i.e., the size of the document).</p><p><strong>Link</strong></p><p>The thickness of a link reflects the number of links between documents.</p><p><img src=\"assets/BP_02.png\" alt=\"\" /></p><p>In Inventory View, it is possible to select nodes to create a stack for entering Stack View, as seen in the image above.</p><h2 id=\"2-stack-view\">2. Stack View</h2><p>A <strong>stack</strong> comprises a set of documents represented as <strong>layers</strong> that contain <strong>content items</strong>.</p><p><img src=\"assets/BP_A.png\" alt=\"\" /></p><p><strong>Stack</strong></p><p>A stack can be thought of as a workspace. The inventory in its entirety may contain complex layers of information, so creating stacks is a convenient method for engaging with complexity by selecting those to view in more detail.</p><p><strong>Layer</strong></p><p>A document is represented as a layer, which instead of having a single title, has a tag. In the image below, there are four layers: <code class=\"language-plaintext highlighter-rouge\">#MAIN,</code> <code class=\"language-plaintext highlighter-rouge\">#A,</code> <code class=\"language-plaintext highlighter-rouge\">#B,</code> and <code class=\"language-plaintext highlighter-rouge\">#C.</code></p><p><strong>Content Item</strong></p><p>Content items are the parts that make up a text. A content item can have any number of tags, placing it in multiple layers.</p><p><img src=\"assets/BP_B.png\" alt=\"\" /></p><p><strong>Link Types</strong></p><p>In the image below, there are several links between the layers. As defined in the <a href=\"03\">previous entry</a>, there are two main categories of connections that cross the boundaries of documents: those that are transclusions (reused content items; inclusions of one document segment into another), and those that are not transclusions. In the image below, these two types are visually distinguished by dot-line-dot links and side-surface links.</p><p>✱ These two link types must be visually distinguished, but the visual form is subject to change.</p><p><img src=\"assets/BP_C.png\" alt=\"\" /></p><p>The links that are not transclusions are categorized according to whichever taxonomy people wish to develop within the construct, hence the appropriation of the common usage of a hashtag as a metadata tag. For example, in the image below, if content item <code class=\"language-plaintext highlighter-rouge\">ID_P2</code> is a comment on content item <code class=\"language-plaintext highlighter-rouge\">ID_P1</code>, then the layer could be tagged <code class=\"language-plaintext highlighter-rouge\">#COMMENTS.</code> If the other two layers are different references, these layers could be tagged <code class=\"language-plaintext highlighter-rouge\">#REFERENCE_X</code> and <code class=\"language-plaintext highlighter-rouge\">#REFERENCE_Y.</code></p><p><img src=\"assets/BP_D.png\" alt=\"\" /></p><p>It is also possible to display links only between a selection of layers in the stack. Upon selection, the stack is rearranged. The layers <code class=\"language-plaintext highlighter-rouge\">#MAIN</code> and <code class=\"language-plaintext highlighter-rouge\">#COMMENTS</code> are selected in the two images below, displaying the links between them, followed by stack rearrangement.</p><p><img src=\"assets/BP_X.png\" alt=\"\" /></p><p><img src=\"assets/BP_X2.png\" alt=\"\" /></p><p>While in Stack View, it is possible to merge all or a selection of layers. The arrangement of the stack will determine how the layers are merged.</p><h2 id=\"3-merge-view\">3. Merge View</h2><p><code class=\"language-plaintext highlighter-rouge\">#MAIN</code> and <code class=\"language-plaintext highlighter-rouge\">#COMMENTS</code> are merged side by side in the image below.</p><p><img src=\"assets/BP_Y.png\" alt=\"\" /></p><p>Only the linked content items (between <code class=\"language-plaintext highlighter-rouge\">#MAIN</code> and <code class=\"language-plaintext highlighter-rouge\">#COMMENTS</code>) are displayed side by side in the image below.</p><p><img src=\"assets/BP_Z1.png\" alt=\"\" /></p><p>The image below shows the option for merging the content items sequentially. If another layer were included, the order would depend on the arrangement of layers in Stack View.</p><p><img src=\"assets/BP_Z2.png\" alt=\"\" /></p>",
            "url": "/forking_the_docuverse_weblog/04",
            
            
            
            
            
            "date_published": "2021-08-18T00:00:00+02:00",
            "date_modified": "2021-08-18T00:00:00+02:00",
            
                "author": 
                "Rebecca Rui"
                
            
        },
    
        {
            "id": "/forking_the_docuverse_weblog/03",
            "title": "Background: On Interconnection and the Boundary of Documents",
            "summary": null,
            "content_text": "The first section of this entry introduces the concept of interconnection, the various terms used to express the idea of interconnection across fields, and the underlying philosophical position. The second section examines analog and digital systems developed throughout history, comprising concepts for representing interconnection. Those concepts are juxtaposed to how they have been implemented in commonly known systems, such as how hypertext is implemented on the Web. The biases and conventions inherited from paper documents are also discussed, including the (dis)advantages of transferring these (or how these have been transferred) to the digital realm. The aim is to gather insight into which features of the systems can be utilized in creating a construct based on accommodating interconnection.The motivation behind this approach resonates with what Mary Hopper stated in her introduction to the 1998 symposium Hypertext in Historical Context: Vannevar Bush and Ted Nelson Revisited:  Consider that there may be vast potentials in electronic media that we still haven’t implemented, and we may be in danger of missing some of the greatest potential in electronic media because we mistake some situational limitations in technical development or project management for impossibility. This is the grounds upon which I suggest that the past is of more than just historical interest. The past, and the pioneers who shaped the past, may hold many suggestions as to paths it might be valuable to explore in the future and advice on the most productive ways to go down those paths. (Hopper 1998)InterconnectionThe concept of interconnection denotes the various connections among the content items1 of documents. As Ted Nelson (1987) explains, connections can be internal or external to a document, stated implicitly or explicitly. For example, phrases such as “in the example given below” or “as defined previously” establish implicit internal connections.  Explicit internal connections are content items that by convention take the form of a footnote or marginal annotations — the content of which can be a commentary on an idea, clarification of a term, parenthetical information and suchlike. Explicit external connections are inclusions of one document segment into another (what Nelson (1980) coined transclusions) or some other direct connection by way of reference. Interconnection thus implies multiple potential structures other than the paragraph-by-paragraph sequence of text.There are terms other than interconnection that denote the various connections between documents. As Borgman (2015) writes, “[t]he body of relationships among documents is sometimes known as ‘hypertextuality.’” Hypertext is commonly associated with how it has been implemented on the Web, understood in general terms as “a computer construct of links and data corresponding to files or parts of files that can be displayed in windows of various dimensions (Vandendorpe 2009).” Another term, used particularly within semiotics and literary theory, is intertextuality which describes abstract connections, “as in the influence of one text on the meaning of another” (Borgman 2015). One such connection can be how one text is derived from a preceding text, as with Ulysses by James Joyce, which is a transformation of Odyssey by Homer (Vandendorpe 2009). In the definition of an intertext as it was first proposed, there is an emphasis on the perception of the reader, namely that the connections between one text and one that preceded or followed it results from the activity of reading (Vanderndorpe 2009). Ted Nelson (2015) calls it intertwingularity which “expresses a philosophical position about cross-connection,” namely that “all subjects and issues are intertwined and intermingled.”Hypertextuality, intertextuality, and intertwingularity coincide but not completely. These terms are similar yet different lenses (used within particular fields) to view documents for mapping multiple structures by establishing connections. Interconnection is a general term chosen and used to encompass these various connections between documents that ultimately result in complex layers of information. These connections can be established through reading and writing, but also through computational methods, such as applying natural language processing techniques for classifying text and keyword extraction. In what follows, analog and digital systems comprising concepts for representing interconnection are examined.Analog and Digital SystemsThree examples are examined in detail to gather insight into which features of early systems can be utilized to create a construct based on accommodating interconnection.  The Encyclopédie by Denis Diderot and Jean d’Alembert.  The work of Paul Otlet.  The original hypertext project Xanadu by Ted Nelson.The first two examples are both analog systems. The first is a closed system of internal connections, and the second is an exploration of an open system of connections based on a multidimensional structure. The third is a digital system based on a multidimensional and continuously evolving structure, envisioning the potential of the computer as a literary machine with consideration of its distinctive properties.2 All three examples share the conceptualization of documents as made up of parts that can be linked through some mechanism.1 Encyclopédie by Diderot and d’AlembertVarious information technologies for mapping interconnection (non-)hierarchically were produced in the eighteenth century, ranging from atlases, encyclopedias, dictionaries, and suchlike. The Encyclopédie by Diderot and d’Alembert is a prominent example that, as Rosenberg (2015) argues, was an innovative system for its time. In its entirety, the Encyclopédie is a system of intraconnections — which is to say, a closed system of internal connections — “comprising 28 volumes, 72,000 articles by over 2,000 writers, and more than 3,000 plates” (Rosenberg 2015). Though the design incorporates concepts for representing external connections, the Encyclopédie was conceived and meant to be used as an independent system. A significant feature is the multiple renditions of the contents, offering multiple entry points to the articles. One structure of the Encyclopédie is the alphabetical structure, embedded as running headers throughout the encyclopedia (seen in the image below), allowing access to content by keyword.Transcluded from Internet ArchiveOther ways of accessing content are through the annotated diagrams functioning as visual indexes. A tree diagram from the first volume is seen in the image below.Transcluded from Internet ArchiveThese textual and diagrammatic ways of mapping structures are hierarchical, as was the convention at the time. However, as Rosenberg explains:  Older encyclopedias were generally organized hierarchically and by subject. Theirs was designed to be navigated by keyword, to allow readers to enter and exit at any useful point. Additionally, their encyclopedia was hypertexted. Articles were linked in a web through a system of renvois or cross-references. The Encyclopédie also offered a hierarchical subject map, echoing the structure of older works, but, in the work of Diderot and d’Alembert, the tree of knowledge was presented as only one of several heuristics. (Rosenberg 2015)Additionally, as the computer-generated diagram (seen in the image below) elucidate, “implicit in the system of cross-references of the Encyclopédie” (Rosenberg 2015) is an underlying network structure in which there are many-to-many relationships among subjects.Diagram by Olsen and Blanchard (transcluded from Rosenberg (2015))First, the diagram elucidates that conceiving knowledge as fundamentally hierarchical is not “paradigmatic of Enlightenment epistemology.” Second, nor is it intrinsic to print. Rather, all subjects are interconnected, and as Rosenberg argues, though the  network diagram would not have been familiar to the generation of the Encyclopedists, the concepts behind it were. They too were thinking about intellectual phenomena in terms of underlying structures and aggregate relationships. (Rosenberg 2015)2 The Work of Paul OtletThe work of Paul Otlet — regarded as a pioneer of the field once called documentation that branched into what is now called information science (Le Deuff and Perret 2019) — range from devising the model called Functional Requirements for Bibliographic Records in which entities are linked on multiple levels in the form of a network (Borgman 2015) to developing new approaches to organizing and accessing information by establishing theoretical principles of information. Additionally, Otlet explored how information organization might be in the future in the form of illustrations serving as metaphors of a global network of documents once media other than the book would take precedence (Heuvel and Rayward 2011).Similar to the Encyclopédie — a project that is seen as in response to the eighteenth-century information overload (Rosenberg 2015) — Otlet’s work was in response to the problem of “the enormous growth in the number of publications, specialist congresses, and international exhibitions that began to occur at the end of the nineteenth century” (Manfroid 2013).As Rayward (1994) formulates it, the problem that Otlet analyzed and explored solutions to was “how most effectively to create, maintain, and change institutional arrangements for collecting, storing, preserving, organizing, retrieving, and disseminating all of the recorded information that is-or will be-needed within society.” With that complex problem at hand, Otlet envisioned new approaches to storing, organizing, and disseminating information while accommodating expansive growth and extensive reuse.A significant feature of the work by Otlet is the conceptualization of text as modular — made up of parts connected to other parts (internal and external to a document). An appropriate system, according to Otlet, must therefore allow and facilitate establishing links between these parts (i.e., content items). In designing such a system, Otlet explored the re-conceptualization of the Book as a global system of documents. As told by Heuvel and Rayward:  In a 1911 lecture on the future of the book and of bibliography, Otlet came back to the idea he had first expressed in 1892 and in subsequent publications: ‘The arbitrary division into lines and pages of the book in its present format, does not at all correspond all with the presentation of ideas’ (p. 291). He envisioned the emergence of a future format of the book in which ‘each intellectual element, in corresponding to a physical element, will create a structure such that any combination of ideas, notions, and facts will be possible.’ He suggested that this process can operate in so mechanical a fashion that in the future, the book will truly become a machine to think with (Otlet transcluded from Heuvel and Rayward (2011))As the illustrations below suggest, for Otlet, the development of such a system entails ripping content items (representing ideas, notions, facts) from books and collecting each on separate paper cards.Global Network of Universal Documentation (transcluded from Heuvel and Rayward (2011))The illustration below expresses a similar notion about the structure of ideas and how knowledge evolves.Title and SourceWith this conceptualization of ideas and knowledge, Otlet based his system on having the capacity to accommodate expansive growth and extensive reuse. For Otlet, this meant the capacity to both store and access content items through links and metadata. Otlet explored a paper card-based system to establish multidimensional links between content items, seen in the image below.Multidimensional card system (transcluded from Heuvel and Rayward (2011))As Otlet writes:  To increase the number of sides, one might well abandon the rectangular form of the card and adopt a polygonal form, an octagon for example. For sorting and systematically selecting the ideas that have been classified hierarchically, the cards are suspended from their centre. The Book as a structure of cards thus takes a quasi-circular form and can rotate. [I]ts structure […] constitutes a Book—for it is still a book—that has abandoned the traditional form of linear text arranged according to a unique plan. It has been transformed in some way into a body with several dimensions, as many dimensions as headings such that different searches using the same graphic elements on the cards are possible. (Otlet transcluded from Heuvel and Rayward (2011))As Heuvel and Rayward (2011) point out, though the material manifestation of such a paper card system is “impractical for many reasons,” what Otlet is describing is an open system for mapping and accessing content, based on the interconnection of subjects. Beyond these experiments with paper cards, Otlet envisioned new visual representations and approaches to accessing content. For example, in the image below, “Otlet uses the architectural metaphor of the factory to visualize this process” (Heuvel 2017).Laboratorium Mundaneum (transcluded from Wikimedia Commons)Though the material constraints of paper-based technologies inhibited Otlet (e.g., books, paper cards, shelves, cabinets, and desks), he envisioned new ways of organizing and accessing information beyond what Adriaan van der Weel (2012) calls the order of the book.33 Xanadu by Ted NelsonNelson is most known for inventing the back button, and developing concepts such as hypertext, virtuality, and the docuverse. Hypertext is likely the most known but is merely one of the many concepts Nelson has spent decades developing within a larger project called Xanadu. Though Xanadu has never been fully implemented, the many prototypes and writings throughout the decades since the 1960s have had a profound impact on the evolution of hypertext, influencing several projects including the World Wide Web, “as its own inventor Tim Berners-Lee acknowledged” (Ridi 2018).Xanadu is a hypertext system, a docuverse, technically a piece of software that since its conception has been designed to run on a global network of computers in which every document is to reside (Ridi 2018). Much akin to the work of Otlet, Xanadu is based on particular notions about how knowledge evolves and the structure of ideas. As Nelson writes:  The physical universe is not all that decays. So do abstraction and categories. Human ideas, science, scholarship, and language constantly collapsing and unfolding. Any field, and the corpus of all fields, is a bundle of relationships subject to all kinds of twists, inversions, involutions, and rearrangement. (Nelson 1965)According to Nelson, it is this continuous evolution that a system must be designed to accommodate — to have the capacity for new categorization systems and any arrangements of old and new content. On the structure of thoughts and ideas, Nelson writes:  [A]s you consider a thing, your thoughts crisscross it constantly, reviewing first one connection, then another. Each new idea is compared with many parts of the whole picture, or with some mental visualization of the whole picture itself. (Nelson 1987)In line with the notion that the structure of ideas is nonsequential, in his book Literary Machines (first published in 1980), Nelson defines hypertext as “nonsequential writing—text that branches and allows choices to the reader” (Nelson 1987). Whereas writing and structuring sequential text entails choosing “one expository sequence from among the possible myriad,” writing nonsequential text entails deciding on the “interconnective structure” — “where to put things in the searchable maze” (Nelson 1987). It is based on these definitions and notions about how ideas and knowledge evolve that Nelson envisioned Xanadu.Xanadu has gone through many revisions and different prototype implementations over the span of six decades, but the core concepts have fundamentally remained the same. In what follows, those concepts are examined with reflections on some of the implementations and juxtaposed to how some of its concepts are implemented on the Web.History ManagementXanadu is a system that stores (and makes accessible) every change made to documents’ contents and linkages, integrated in such a way that former states can be retrieved and reworked (Nelson 1987). As seen in the image below, people can choose whether those changes are local/private or online/public.Transcluded from Nelson (1987)Once a document is online/public, any changes made (e.g., if the author revises the content, or readers reuse parts of a document or create links to/from a document) are stored; effectively, the history of every document is accessible to anyone. This would be the same if the Web were built with an integrated history management system such as Git, not as an optional tool but as a core feature.Bidirectional Visual LinksBeyond the history dimension, the multidimensional structure of Xanadu is designed for two main categories of connections between documents, expressed by two link types: content links and transclusions. Content links are the arbitrary connections that people (writers and readers) create as they engage with text, and transclusions are reused content items. By convention, transclusions are what are known as excerpts and typographically distinguished as block quotes or inline quotes, and the link between the copied and the pasted is usually embedded as a citation. However, as Nelson writes:  Transclusion is what quotation, copying and cross-referencing merely attempt: they are ways that people have had to imitate transclusion, which is the true abstract relationship that paper cannot show. (Nelson 1999)Content items are not duplicated; rather, transcluded — included in a document with a visual link to the original document. Additionally, since all links are bidirectional, every outward and inward-pointing link is accessible, which means the original document also points to documents that reuse parts of its contents. In this way, transclusions offer a way to retrieve “the origins and context of quotations, excerpts and anthologized materials, and content transiting between versions” (Nelson 1999). Important to note is that links are not embedded but technically implemented as an overlay, much akin to “a cache, or an alias on the desktop” (Nelson 1999). This technicality enables multiple overlapping links in the same document. Additionally, because all changes are stored, even if the original document undergoes changes, it is always possible to view the content item in its original context at the time it was transcluded.In contrast, links on the Web are embedded (in HTML) and only point outward. When a website is cited as a source in a text, it usually indicates the date the website was accessed. However, if the contents of the website have been deleted or changed since then, though the date on which it was updated might be displayed, there is no way of accessing previous versions. Additionally, link endpoints on the Web are at the level of the document, or page rather,4 whereas, in Xanadu, link endpoints are at the level of the content item. The implication is that a link can point from a particular part of a document to a particular part of another document. As for how this would look and work, Nelson envisioned Xanadu as a system in which documents are viewed side-by-side with visual links, expressed by two concepts: parallel documents and transpointing windows (Nelson 1999).An improvement would be landing at the particular linked part of a document:Side-By-Side Documents With Visual LinksParallel documents, according to Nelson:  are everywhere, but are not generally acknowledged. There are relatively few explicitly parallel documents (like Tom Stoppard’s play “Rosencrantz and Guildenstern Are Dead”, which is explicitly parallel to “Hamlet” – showing events that occur offstage in “Hamlet”, and vice versa). But implicitly parallel documents are everywhere – the parallelism of commentaries, the parallelism of long and short versions of reports, the parallelism of translations, the parallelism of holy books. (Nelson 1998)Engaging with text should entail viewing documents side-by-side with transpointing windows, which are meant to:  support analysis and detailed understanding – by parallel commentary, precise annotation and the explication of contents; by the facilitation of pinpoint controversy. These are needed not just in scholarship, but legislation, diplomacy, and anywhere that interrelated documents need to be seen[…for] detailed explication, commentary or disagreement[, and for] comparing successive versions of a document. (Nelson 1999)A prototype from 2003, in which the links are solid lines, pointing to and from content items within windows, is seen in the image below.5Transcluded from Nelson (2015)In another prototype, the links are applied not as solid lines but as color-coded highlights. Additionally, the main document is placed in the middle, and the linked documents are placed on the left and right sides with a smaller font size.Screenshot of Xanadoc (try the interactive demo here)In the latest Xanadu prototype, which is in 3D,6 the linked documents appear on the sides when moving through the contents, or as Nelson puts it: “all objects sworfing (swooping and/or morphing) together” (Nelson 2016).Transcluded from Nelson (2016)A demonstration of sworfing is given by Nelson in the video below.7These prototypes prompt a reasonable concern: how to manage the complexity that may (most definitely) result from creating multiple overlapping transclusions and content links. Moreover, there can be an infinite number of sub-categories within the two main categories of link types. Whereas Otlet’s experiments with paper cards are impractical in terms of implementation because of material constraints, the problem of creating and mapping structures in the digital realm has to do with how to display and interact with the resulting complex information. This, of course, has been a central concern for decades, as suggested by Conklin (1987) in his analysis of hypertext systems in the 1980s.Transcluded from Conklin (1987)Nelson refers to it as the framing problem (seen in the image below), to which he notes that “filtering links is a key aspect of front-end design [which] is a separate study in itself” (Nelson 1987).8Transcluded from Nelson (1987)A Selection of System FeaturesDiscussed below are a selection of features of the three examples that will be reworked and incorporated in the design of the construct.Significant to the design of the Encyclopédie is that there are multiple points of entry through both textual and visual renditions of its contents, which in the construct can be implemented as different view modes. The computer-generated diagram, elucidating the underlying network structure of connections within the Encyclopédie, is deemed particularly useful for gaining an infographic-like overview of the number of connections between documents. As seen in Otlet’s illustrations of the evolution of knowledge, it is essentially a process of decomposition and recomposition of parts. To facilitate that process, several links pointing to the same part of a document should be possible. In addition to attaching links between content items, it should be possible to attach metadata to documents to establish connections. Xanadu is a system with a multidimensional structure designed to accommodate two main link types: those created when establishing arbitrary connections and those created when content items of one document are reused in another document. This categorical distinction is deemed useful, but a design solution is required for the various sub-categories within the arbitrary connections, allowing the possibility to filter links. As shared by all three examples, the design of the construct will also be based on the conception of documents as made up of parts that can be linked through some mechanism. This implies the possibility for a link to point to an entire document or a particular content item within a document. Lastly, designing the construct will explore the visual form of links, how to indicate the link direction, and how to provide direct access to linked documents, whether by viewing documents side-by-side or some other means.SourcesBorgman CL. Data, Metadata, and Ted. In: Dechow DR, Struppa DC, editors. Intertwingled. Cham: Springer International Publishing; 2015. p. 67–74.DeRose SJ. What Is Text, Really? Journal of Computing in Higher Education. 1990;1(2):3–26.Le Deuff O, Perret A. Hyperdocumentation: origin and evolution of a concept. JD. 2019;75(6):1463–74.Heuvel C van den. Building Society, Constructing Knowledge, Weaving the Web: Otlet’s Visualizations of a Global Information Society and His Concept of a Universal Civilization. In: Rayward WB, editor. European Modernism and the Information Society: Informing the Present, Understanding the Past. 1st ed. Routledge; 2017Heuvel C van den, Rayward WB. Facing interfaces: Paul Otlet’s visualizations of data integration. J. Am. Soc. Inf. Sci. 2011;62(12):2313–26.Hopper M. Vannevar Bush and Ted Nelson Revisited. Hypertext in Historical Context [Internet]. MIT Media Lab; 1998. Available from: http://web.mit.edu/m-i-t/forums/hypertext/hypertext.htm#missingManfroid S, Gillen J, Phillips-Batoma PM. The Archives of Paul Otlet: Between Appreciation and Rediscovery, 1944–2013. Library Trends. 2013;62(2):311–28.Nelson TH. A File Structure for the Complex, the 134 Changing and the Indeterminate. 1965;13.Nelson TH. Computer Lib Dream Machines. 1974.Nelson TH. Literary Machines: The report on, and of, Project Xanadu concerning word processing, electronic publishing, hypertext, thinkertoys, tomorrow’s intellectual revolution, and certain other topics including knowledge, education and freedom. 87.1. Sausalito, California: Mindful Press; 1987.Nelson TH. Xanalogical Structure, Needed Now More than Ever: Parallel Documents, Deep Links to Content, Deep Versioning, and Deep Re-Use. ACM Computing Surveys. 1999;31(4):32.photonhunter. Ted Nelson on Zigzag data structures [Internet]. 2008 [cited 2021 October 30]. Available from: https://www.youtube.com/watch?v=WEj9vqVvHPcNelson TH. What Box? In: Dechow DR, Struppa DC, editors. Intertwingled. Cham: Springer International Publishing; 2015. p. 133–50.Nelson TH. The Xanadu Universe [Internet]. 2016 [cited 2021 Oct 28]. Available from: https://xanadu.com/xUniverse-D6Rayward WB. Visions of Xanadu: Paul Otlet (1868–1944) and Hypertext. Journal of the American Society for Information Science. 1994;16.Ridi R. Hypertext. Knowledge Organization. 2018;45(5):393–424.Rosenberg D. History Debugged. In: Dechow DR, Struppa DC, editors. Intertwingled. Cham: Springer International Publishing; 2015. p. 91–103.Van der Weel A. Changing Our Textual Minds: Towards a Digital Order of Knowledge. Manchester University Press; 2012.Endnotes            Content items are what Steven DeRose (1990) calls “content objects,” what Charles van den Heuvel and W. Boyd Rayward (2011) call “information chunks,” and what Ridi (2018) calls “information units.” In conventional terms, a paragraph, for example, is a content item; a quote within a paragraph is also a content item; a list and a list item are content items. &#8617;              These distinctive properties, as discussed under the question What are the distinct properties of a digital document versus a paper document? in [Questions That Follow], means the computer holds greater potential than earlier analog mediums. Firstly, that the computer is a universal machine means “that it is an instrument capable of performing on text not only all medial functions such as creating, editing, storing, publishing, distributing and consuming it, but also operations of various kinds. [F]unctioning electronically and digitally, [it can] run every conceivable type of application (Weel 2012),” which by implication means that any conceivable construct can be embedded. A third distinctive property, which engendered transformative change, is that once computers began operating in a global digital network, the “medial role” of the computer went from being a tool for aiding “text production and printing to that of a wholly new digital medium in its own right” (Weel 2012). It became the medium that “covers the entire communications circuit, including the production (writing, editing) of texts, down to their distribution and even consumption” (Weel 2012). Nelson considered the potential of these properties for envisioning how the computer could become a literary machine transforming how we engage and work with text. &#8617;              As stated in [Questions That Follow], the order of the book is the presentation and structure of text based on the form of books and defined by the format of manuscript and print. &#8617;              Traversing content on the Web by selecting hyperlinks commonly entails blindly jumping and landing at the top of the page: &#8617;              Note that the link direction is unclear, and the position and overlap of the windows are not convenient. &#8617;              One problem with this 3D version is that there is no obvious way of navigating the space. For reading and editing a document, it could be useful to snap into a full-frame view of a particular part of a document. &#8617;              The idea of viewing documents side-by-side is solid, but having documents fly in and out of view as you move through the document is not. There should be an interaction step in between, in which the content is only opened through deliberate action. &#8617;              …the intention behind this project is to contribute to this aspect. &#8617;      ",
            "content_html": "<p>The first section of this entry introduces the concept of interconnection, the various terms used to express the idea of interconnection across fields, and the underlying philosophical position. The second section examines analog and digital systems developed throughout history, comprising concepts for representing interconnection. Those concepts are juxtaposed to how they have been implemented in commonly known systems, such as how hypertext is implemented on the Web. The biases and conventions inherited from paper documents are also discussed, including the (dis)advantages of transferring these (or how these have been transferred) to the digital realm. The aim is to gather insight into which features of the systems can be utilized in creating a construct based on accommodating interconnection.</p><p>The motivation behind this approach resonates with what Mary Hopper stated in her introduction to the 1998 symposium <em>Hypertext in Historical Context: Vannevar Bush and Ted Nelson Revisited</em>:</p><blockquote>  <p>Consider that there may be vast potentials in electronic media that we still haven’t implemented, and we may be in danger of missing some of the greatest potential in electronic media because we mistake some situational limitations in technical development or project management for impossibility. This is the grounds upon which I suggest that the past is of more than just historical interest. The past, and the pioneers who shaped the past, may hold many suggestions as to paths it might be valuable to explore in the future and advice on the most productive ways to go down those paths. (Hopper 1998)</p></blockquote><h2 id=\"interconnection\">Interconnection</h2><p>The concept of interconnection denotes the various connections among the content items<sup id=\"fnref:content_item\" role=\"doc-noteref\"><a href=\"#fn:content_item\" class=\"footnote\" rel=\"footnote\">1</a></sup> of documents. As Ted Nelson (1987) explains, connections can be internal or external to a document, stated implicitly or explicitly. For example, phrases such as “in the example given below” or “as defined previously” establish <strong>implicit internal connections</strong>.  <strong>Explicit internal connections</strong> are content items that by convention take the form of a footnote or marginal annotations — the content of which can be a commentary on an idea, clarification of a term, parenthetical information and suchlike. <strong>Explicit external connections</strong> are inclusions of one document segment into another (what Nelson (1980) coined transclusions) or some other direct connection by way of reference. Interconnection thus implies multiple potential structures other than the paragraph-by-paragraph sequence of text.</p><p>There are terms other than <em>interconnection</em> that denote the various connections between documents. As Borgman (2015) writes, “[t]he body of relationships among documents is sometimes known as ‘<em>hypertextuality</em>.’” <em>Hypertext</em> is commonly associated with how it has been implemented on the Web, understood in general terms as “a computer construct of links and data corresponding to files or parts of files that can be displayed in windows of various dimensions (Vandendorpe 2009).” Another term, used particularly within semiotics and literary theory, is <em>intertextuality</em> which describes abstract connections, “as in the influence of one text on the meaning of another” (Borgman 2015). One such connection can be how one text is derived from a preceding text, as with Ulysses by James Joyce, which is a transformation of Odyssey by Homer (Vandendorpe 2009). In the definition of an <em>intertext</em> as it was first proposed, there is an emphasis on the perception of the reader, namely that the connections between one text and one that preceded or followed it results from the activity of reading (Vanderndorpe 2009). Ted Nelson (2015) calls it <em>intertwingularity</em> which “expresses a philosophical position about cross-connection,” namely that “all subjects and issues are intertwined and intermingled.”</p><p><em>Hypertextuality</em>, <em>intertextuality</em>, and <em>intertwingularity</em> coincide but not completely. These terms are similar yet different lenses (used within particular fields) to view documents for mapping multiple structures by establishing connections. <em>Interconnection</em> is a general term chosen and used to encompass these various connections between documents that ultimately result in complex layers of information. These connections can be established through reading and writing, but also through computational methods, such as applying natural language processing techniques for classifying text and keyword extraction. In what follows, analog and digital systems comprising concepts for representing interconnection are examined.</p><h2 id=\"analog-and-digital-systems\">Analog and Digital Systems</h2><p>Three examples are examined in detail to gather insight into which features of early systems can be utilized to create a construct based on accommodating interconnection.</p><ol>  <li>The Encyclopédie by Denis Diderot and Jean d’Alembert.</li>  <li>The work of Paul Otlet.</li>  <li>The original hypertext project Xanadu by Ted Nelson.</li></ol><p>The first two examples are both analog systems. The first is a closed system of internal connections, and the second is an exploration of an open system of connections based on a multidimensional structure. The third is a digital system based on a multidimensional and continuously evolving structure, envisioning the potential of the computer as a <em>literary machine</em> with consideration of its distinctive properties.<sup id=\"fnref:distinctive_properties\" role=\"doc-noteref\"><a href=\"#fn:distinctive_properties\" class=\"footnote\" rel=\"footnote\">2</a></sup> All three examples share the conceptualization of documents as made up of parts that can be linked through some mechanism.</p><h3 id=\"1-encyclopédie-by-diderot-and-dalembert\">1 Encyclopédie by Diderot and d’Alembert</h3><p>Various information technologies for mapping interconnection (non-)hierarchically were produced in the eighteenth century, ranging from atlases, encyclopedias, dictionaries, and suchlike. The Encyclopédie by Diderot and d’Alembert is a prominent example that, as Rosenberg (2015) argues, was an innovative system for its time. In its entirety, the Encyclopédie is a system of <em>intraconnections</em> — which is to say, a closed system of internal connections — “comprising 28 volumes, 72,000 articles by over 2,000 writers, and more than 3,000 plates” (Rosenberg 2015). Though the design incorporates concepts for representing external connections, the Encyclopédie was conceived and meant to be used as an independent system. A significant feature is the multiple renditions of the contents, offering multiple entry points to the articles. One structure of the Encyclopédie is the alphabetical structure, embedded as running headers throughout the encyclopedia (seen in the image below), allowing access to content by keyword.</p><p><img src=\"assets/encyclopdie_vol01_internet_archives_AMA.png\" alt=\"\" /></p><p><em>Transcluded from <a href=\"https://archive.org/details/encyclopdieoud01alem/page/312/mode/2up\">Internet Archive</a></em></p><p>Other ways of accessing content are through the annotated diagrams functioning as visual indexes. A tree diagram from the first volume is seen in the image below.</p><p><img src=\"assets/encyclopdie_vol01_internet_archives_tree_map.png\" alt=\"\" /></p><p><em>Transcluded from <a href=\"https://archive.org/details/encyclopdieoud01alem/page/n69/mode/1up\">Internet Archive</a></em></p><p>These textual and diagrammatic ways of mapping structures are hierarchical, as was the convention at the time. However, as Rosenberg explains:</p><blockquote>  <p>Older encyclopedias were generally organized hierarchically and by subject. Theirs was designed to be navigated by keyword, to allow readers to enter and exit at any useful point. Additionally, their encyclopedia was hypertexted. Articles were linked in a web through a system of renvois or cross-references. The Encyclopédie also offered a hierarchical subject map, echoing the structure of older works, but, in the work of Diderot and d’Alembert, the tree of knowledge was presented as only one of several heuristics. (Rosenberg 2015)</p></blockquote><p>Additionally, as the computer-generated diagram (seen in the image below) elucidate, “implicit in the system of cross-references of the Encyclopédie” (Rosenberg 2015) is an underlying network structure in which there are many-to-many relationships among subjects.</p><p><img src=\"assets/diderot_encyclopedie_map_crop.png\" alt=\"\" /></p><p><em>Diagram by Olsen and Blanchard (transcluded from Rosenberg (2015))</em></p><p>First, the diagram elucidates that conceiving knowledge as fundamentally hierarchical is not “paradigmatic of Enlightenment epistemology.” Second, nor is it intrinsic to print. Rather, all subjects are interconnected, and as Rosenberg argues, though the</p><blockquote>  <p>network diagram would not have been familiar to the generation of the Encyclopedists, the concepts behind it were. They too were thinking about intellectual phenomena in terms of underlying structures and aggregate relationships. (Rosenberg 2015)</p></blockquote><h3 id=\"2-the-work-of-paul-otlet\">2 The Work of Paul Otlet</h3><p>The work of Paul Otlet — regarded as a pioneer of the field once called documentation that branched into what is now called information science (Le Deuff and Perret 2019) — range from devising the model called Functional Requirements for Bibliographic Records in which entities are linked on multiple levels in the form of a network (Borgman 2015) to developing new approaches to organizing and accessing information by establishing theoretical principles of information. Additionally, Otlet explored how information organization might be in the future in the form of illustrations serving as metaphors of a global network of documents once media other than the book would take precedence (Heuvel and Rayward 2011).</p><p>Similar to the Encyclopédie — a project that is seen as in response to the eighteenth-century information overload (Rosenberg 2015) — Otlet’s work was in response to the problem of “the enormous growth in the number of publications, specialist congresses, and international exhibitions that began to occur at the end of the nineteenth century” (Manfroid 2013).</p><p>As Rayward (1994) formulates it, the problem that Otlet analyzed and explored solutions to was “how most effectively to create, maintain, and change institutional arrangements for collecting, storing, preserving, organizing, retrieving, and disseminating all of the recorded information that is-or will be-needed within society.” With that complex problem at hand, Otlet envisioned new approaches to storing, organizing, and disseminating information while accommodating expansive growth and extensive reuse.</p><p>A significant feature of the work by Otlet is the conceptualization of text as modular — made up of parts connected to other parts (internal and external to a document). An appropriate system, according to Otlet, must therefore allow and facilitate establishing links between these <em>parts</em> (i.e., content items). In designing such a system, Otlet explored the re-conceptualization of the Book as a global system of documents. As told by Heuvel and Rayward:</p><blockquote>  <p>In a 1911 lecture on the future of the book and of bibliography, Otlet came back to the idea he had first expressed in 1892 and in subsequent publications: ‘The arbitrary division into lines and pages of the book in its present format, does not at all correspond all with the presentation of ideas’ (p. 291). He envisioned the emergence of a future format of the book in which ‘each intellectual element, in corresponding to a physical element, will create a structure such that any combination of ideas, notions, and facts will be possible.’ He suggested that this process can operate in so mechanical a fashion that in the future, the book will truly become a machine to think with (Otlet transcluded from Heuvel and Rayward (2011))</p></blockquote><p>As the illustrations below suggest, for Otlet, the development of such a system entails <em>ripping</em> content items (representing ideas, notions, facts) from books and collecting each on separate paper cards.</p><p><img src=\"assets/the-book-in-connection-with-the-library-the-bibliographic-repertory-and-encyclopedia.png\" alt=\"\" /></p><p><em>Global Network of Universal Documentation (transcluded from Heuvel and Rayward (2011))</em></p><p>The illustration below expresses a similar notion about the structure of ideas and how knowledge evolves.</p><p><img src=\"assets/otlet_raite_de_documentation.jpg\" alt=\"\" /></p><p><em>Title and Source</em></p><!-- %%find source%% --><p>With this conceptualization of ideas and knowledge, Otlet based his system on having the capacity to accommodate expansive growth and extensive reuse. For Otlet, this meant the capacity to both store and access content items through links and metadata. Otlet explored a paper card-based system to establish multidimensional links between content items, seen in the image below.</p><p><img src=\"assets/otlet_card_experiments.png\" alt=\"\" /></p><p><em>Multidimensional card system (transcluded from Heuvel and Rayward (2011))</em></p><p>As Otlet writes:</p><blockquote>  <p>To increase the number of sides, one might well abandon the rectangular form of the card and adopt a polygonal form, an octagon for example. For sorting and systematically selecting the ideas that have been classified hierarchically, the cards are suspended from their centre. The Book as a structure of cards thus takes a quasi-circular form and can rotate. [I]ts structure […] constitutes a Book—for it is still a book—that has abandoned the traditional form of linear text arranged according to a unique plan. It has been transformed in some way into a body with several dimensions, as many dimensions as headings such that different searches using the same graphic elements on the cards are possible. (Otlet transcluded from Heuvel and Rayward (2011))</p></blockquote><p>As Heuvel and Rayward (2011) point out, though the material manifestation of such a paper card system is “impractical for many reasons,” what Otlet is describing is an open system for mapping and accessing content, based on the interconnection of subjects. Beyond these experiments with paper cards, Otlet envisioned new visual representations and approaches to accessing content. For example, in the image below, “Otlet uses the architectural metaphor of the factory to visualize this process” (Heuvel 2017).</p><p><img src=\"assets/otlet_mundaneum.jpg\" alt=\"\" /></p><p><em>Laboratorium Mundaneum (transcluded from <a href=\"https://upload.wikimedia.org/wikipedia/commons/a/a9/Laboratorium_Mundaneum.jpg\">Wikimedia Commons</a>)</em></p><p>Though the material constraints of paper-based technologies inhibited Otlet (e.g., books, paper cards, shelves, cabinets, and desks), he envisioned new ways of organizing and accessing information beyond what Adriaan van der Weel (2012) calls the <em>order of the book</em>.<sup id=\"fnref:order_of_the_book\" role=\"doc-noteref\"><a href=\"#fn:order_of_the_book\" class=\"footnote\" rel=\"footnote\">3</a></sup></p><h3 id=\"3-xanadu-by-ted-nelson\">3 Xanadu by Ted Nelson</h3><p>Nelson is most known for inventing the <em>back button</em>, and developing concepts such as <em>hypertext</em>, <em>virtuality</em>, and the <em>docuverse</em>. Hypertext is likely the most known but is merely one of the many concepts Nelson has spent decades developing within a larger project called Xanadu. Though Xanadu has never been fully implemented, the many prototypes and writings throughout the decades since the 1960s have had a profound impact on the evolution of hypertext, influencing several projects including the World Wide Web, “as its own inventor Tim Berners-Lee acknowledged” (Ridi 2018).</p><p>Xanadu is a hypertext system, a docuverse, technically a piece of software that since its conception has been designed to run on a global network of computers in which every document is to reside (Ridi 2018). Much akin to the work of Otlet, Xanadu is based on particular notions about how knowledge evolves and the structure of ideas. As Nelson writes:</p><blockquote>  <p>The physical universe is not all that decays. So do abstraction and categories. Human ideas, science, scholarship, and language constantly collapsing and unfolding. Any field, and the corpus of all fields, is a bundle of relationships subject to all kinds of twists, inversions, involutions, and rearrangement. (Nelson 1965)</p></blockquote><p>According to Nelson, it is this continuous evolution that a system must be designed to accommodate — to have the capacity for new categorization systems and any arrangements of old and new content. On the structure of thoughts and ideas, Nelson writes:</p><blockquote>  <p>[A]s you consider a thing, your thoughts crisscross it constantly, reviewing first one connection, then another. Each new idea is compared with many parts of the whole picture, or with some mental visualization of the whole picture itself. (Nelson 1987)</p></blockquote><p>In line with the notion that the structure of ideas is nonsequential, in his book Literary Machines (first published in 1980), Nelson defines <em>hypertext</em> as “nonsequential writing—text that branches and allows choices to the reader” (Nelson 1987). Whereas writing and structuring sequential text entails choosing “one expository sequence from among the possible myriad,” writing nonsequential text entails deciding on the “interconnective structure” — “where to put things in the searchable maze” (Nelson 1987). It is based on these definitions and notions about how ideas and knowledge evolve that Nelson envisioned Xanadu.</p><p>Xanadu has gone through many revisions and different prototype implementations over the span of six decades, but the core concepts have fundamentally remained the same. In what follows, those concepts are examined with reflections on some of the implementations and juxtaposed to how some of its concepts are implemented on the Web.</p><p><strong>History Management</strong></p><p>Xanadu is a system that stores (and makes accessible) every change made to documents’ contents and linkages, integrated in such a way that former states can be retrieved and reworked (Nelson 1987). As seen in the image below, people can choose whether those changes are local/private or online/public.</p><p><img src=\"assets/nelson_public_private.png\" alt=\"\" /><em>Transcluded from Nelson (1987)</em></p><p>Once a document is online/public, any changes made (e.g., if the author revises the content, or readers reuse parts of a document or create links to/from a document) are stored; effectively, the history of every document is accessible to anyone. This would be the same if the Web were built with an integrated history management system such as <a href=\"https://en.wikipedia.org/wiki/Git\">Git</a>, not as an optional tool but as a core feature.</p><p><strong>Bidirectional Visual Links</strong></p><p>Beyond the history dimension, the multidimensional structure of Xanadu is designed for two main categories of connections between documents, expressed by two link types: <em>content links</em> and <em>transclusions</em>. Content links are the arbitrary connections that people (writers and readers) create as they engage with text, and <em>transclusions</em> are reused content items. By convention, transclusions are what are known as excerpts and typographically distinguished as block quotes or inline quotes, and the link between the <em>copied</em> and the <em>pasted</em> is usually embedded as a citation. However, as Nelson writes:</p><blockquote>  <p>Transclusion is what quotation, copying and cross-referencing merely attempt: they are ways that people have had to <em>imitate</em> transclusion, which is the true abstract relationship that paper cannot show. (Nelson 1999)</p></blockquote><p>Content items are not duplicated; rather, <em>transcluded</em> — included in a document with a visual link to the original document. Additionally, since all links are bidirectional, every outward and inward-pointing link is accessible, which means the original document also points to documents that reuse parts of its contents. In this way, transclusions offer a way to retrieve “the origins and context of quotations, excerpts and anthologized materials, and content transiting between versions” (Nelson 1999). Important to note is that links are not embedded but technically implemented as an overlay, much akin to “a cache, or an alias on the desktop” (Nelson 1999). This technicality enables multiple overlapping links in the same document. Additionally, because all changes are stored, even if the original document undergoes changes, it is always possible to view the content item in its original context at the time it was transcluded.</p><p>In contrast, links on the Web are embedded (in HTML) and only point outward. When a website is cited as a source in a text, it usually indicates the date the website was accessed. However, if the contents of the website have been deleted or changed since then, though the date on which it was updated might be displayed, there is no way of accessing previous versions. Additionally, link endpoints on the Web are at the level of the document, or <em>page</em> rather,<sup id=\"fnref:links_on_the_web\" role=\"doc-noteref\"><a href=\"#fn:links_on_the_web\" class=\"footnote\" rel=\"footnote\">4</a></sup> whereas, in Xanadu, link endpoints are at the level of the content item. The implication is that a link can point from a particular part of a document to a particular part of another document. As for how this would look and work, Nelson envisioned Xanadu as a system in which documents are viewed side-by-side with visual links, expressed by two concepts: <em>parallel documents</em> and <em>transpointing windows</em> (Nelson 1999).</p><p><img src=\"assets/hypernotes01.png\" alt=\"\" />An improvement would be landing at the particular linked part of a document:<img src=\"assets/hypernotes03.png\" alt=\"\" /></p><p><strong>Side-By-Side Documents With Visual Links</strong></p><p>Parallel documents, according to Nelson:</p><blockquote>  <p>are everywhere, but are not generally acknowledged. There are relatively few explicitly parallel documents (like Tom Stoppard’s play “Rosencrantz and Guildenstern Are Dead”, which is explicitly parallel to “Hamlet” – showing events that occur offstage in “Hamlet”, and vice versa). But implicitly parallel documents are everywhere – the parallelism of commentaries, the parallelism of long and short versions of reports, the parallelism of translations, the parallelism of holy books. (Nelson 1998)</p></blockquote><p>Engaging with text should entail viewing documents side-by-side with <em>transpointing windows</em>, which are meant to:</p><blockquote>  <p>support analysis and detailed understanding – by parallel commentary, precise annotation and the explication of contents; by the facilitation of pinpoint controversy. These are needed not just in scholarship, but legislation, diplomacy, and anywhere that interrelated documents need to be seen[…for] detailed explication, commentary or disagreement[, and for] comparing successive versions of a document. (Nelson 1999)</p></blockquote><p>A prototype from 2003, in which the links are solid lines, pointing to and from content items within windows, is seen in the image below.<sup id=\"fnref:2003_prototype\" role=\"doc-noteref\"><a href=\"#fn:2003_prototype\" class=\"footnote\" rel=\"footnote\">5</a></sup></p><p><img src=\"assets/nelson_cosmicbook.png\" alt=\"\" /><em>Transcluded from Nelson (2015)</em></p><p>In another prototype, the links are applied not as solid lines but as color-coded highlights. Additionally, the main document is placed in the middle, and the linked documents are placed on the left and right sides with a smaller font size.</p><p><img src=\"assets/xanadoc.png\" alt=\"\" /><em>Screenshot of Xanadoc (try the interactive demo <a href=\"https://xanadu.com/xanademos/MoeJusteOrigins.html\">here</a>)</em></p><p>In the latest Xanadu prototype, which is in 3D,<sup id=\"fnref:3D_prototype\" role=\"doc-noteref\"><a href=\"#fn:3D_prototype\" class=\"footnote\" rel=\"footnote\">6</a></sup> the linked documents appear on the sides when moving through the contents, or as Nelson puts it: “all objects sworfing (swooping and/or morphing) together” (Nelson 2016).</p><p><img src=\"assets/nelson_click_full_frame.png\" alt=\"\" /></p><p><img src=\"assets/xanaduspace_2007.png\" alt=\"\" /><em>Transcluded from Nelson (2016)</em></p><p>A demonstration of <em>sworfing</em> is given by Nelson in the video below.<sup id=\"fnref:sworfing\" role=\"doc-noteref\"><a href=\"#fn:sworfing\" class=\"footnote\" rel=\"footnote\">7</a></sup></p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/1yLNGUeHapA?start=274\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe><p>These prototypes prompt a reasonable concern: how to manage the complexity that may (most definitely) result from creating multiple overlapping <em>transclusions</em> and <em>content links</em>. Moreover, there can be an infinite number of sub-categories within the two main categories of link types. Whereas Otlet’s experiments with paper cards are impractical in terms of implementation because of material constraints, the problem of creating and mapping structures in the digital realm has to do with how to display and interact with the resulting complex information. This, of course, has been a central concern for decades, as suggested by Conklin (1987) in his analysis of hypertext systems in the 1980s.</p><p><img src=\"assets/conklin_fig11.png\" alt=\"\" /><em>Transcluded from Conklin (1987)</em></p><p>Nelson refers to it as the <em>framing problem</em> (seen in the image below), to which he notes that “filtering links is a key aspect of front-end design [which] is a separate study in itself” (Nelson 1987).<sup id=\"fnref:front-end-design\" role=\"doc-noteref\"><a href=\"#fn:front-end-design\" class=\"footnote\" rel=\"footnote\">8</a></sup></p><p><img src=\"assets/nelson_framing_problem.png\" alt=\"\" /><em>Transcluded from Nelson (1987)</em></p><h2 id=\"a-selection-of-system-features\">A Selection of System Features</h2><p>Discussed below are a selection of features of the three examples that will be reworked and incorporated in the design of the construct.</p><p>Significant to the design of the Encyclopédie is that there are multiple points of entry through both textual and visual renditions of its contents, which in the construct can be implemented as different view modes. The computer-generated diagram, elucidating the underlying network structure of connections within the Encyclopédie, is deemed particularly useful for gaining an infographic-like overview of the number of connections between documents. As seen in Otlet’s illustrations of the evolution of knowledge, it is essentially a process of decomposition and recomposition of parts. To facilitate that process, several links pointing to the same part of a document should be possible. In addition to attaching links between content items, it should be possible to attach metadata to documents to establish connections. Xanadu is a system with a multidimensional structure designed to accommodate two main link types: those created when establishing arbitrary connections and those created when content items of one document are reused in another document. This categorical distinction is deemed useful, but a design solution is required for the various sub-categories within the arbitrary connections, allowing the possibility to filter links. As shared by all three examples, the design of the construct will also be based on the conception of documents as made up of parts that can be linked through some mechanism. This implies the possibility for a link to point to an entire document or a particular content item within a document. Lastly, designing the construct will explore the visual form of links, how to indicate the link direction, and how to provide direct access to linked documents, whether by viewing documents side-by-side or some other means.</p><h2 id=\"sources\">Sources</h2><p>Borgman CL. Data, Metadata, and Ted. In: Dechow DR, Struppa DC, editors. Intertwingled. Cham: Springer International Publishing; 2015. p. 67–74.</p><p>DeRose SJ. What Is Text, Really? Journal of Computing in Higher Education. 1990;1(2):3–26.</p><p>Le Deuff O, Perret A. Hyperdocumentation: origin and evolution of a concept. JD. 2019;75(6):1463–74.</p><p>Heuvel C van den. Building Society, Constructing Knowledge, Weaving the Web: Otlet’s Visualizations of a Global Information Society and His Concept of a Universal Civilization. In: Rayward WB, editor. European Modernism and the Information Society: Informing the Present, Understanding the Past. 1st ed. Routledge; 2017</p><p>Heuvel C van den, Rayward WB. Facing interfaces: Paul Otlet’s visualizations of data integration. J. Am. Soc. Inf. Sci. 2011;62(12):2313–26.</p><p>Hopper M. Vannevar Bush and Ted Nelson Revisited. Hypertext in Historical Context [Internet]. MIT Media Lab; 1998. Available from: <a href=\"http://web.mit.edu/m-i-t/forums/hypertext/hypertext.htm#missing\">http://web.mit.edu/m-i-t/forums/hypertext/hypertext.htm#missing</a></p><p>Manfroid S, Gillen J, Phillips-Batoma PM. The Archives of Paul Otlet: Between Appreciation and Rediscovery, 1944–2013. Library Trends. 2013;62(2):311–28.</p><p>Nelson TH. A File Structure for the Complex, the 134 Changing and the Indeterminate. 1965;13.</p><p>Nelson TH. Computer Lib Dream Machines. 1974.</p><p>Nelson TH. Literary Machines: The report on, and of, Project Xanadu concerning word processing, electronic publishing, hypertext, thinkertoys, tomorrow’s intellectual revolution, and certain other topics including knowledge, education and freedom. 87.1. Sausalito, California: Mindful Press; 1987.</p><p>Nelson TH. Xanalogical Structure, Needed Now More than Ever: Parallel Documents, Deep Links to Content, Deep Versioning, and Deep Re-Use. ACM Computing Surveys. 1999;31(4):32.</p><p>photonhunter. Ted Nelson on Zigzag data structures [Internet]. 2008 [cited 2021 October 30]. Available from: <a href=\"https://www.youtube.com/watch?v=WEj9vqVvHPc\">https://www.youtube.com/watch?v=WEj9vqVvHPc</a></p><p>Nelson TH. What Box? In: Dechow DR, Struppa DC, editors. Intertwingled. Cham: Springer International Publishing; 2015. p. 133–50.</p><p>Nelson TH. The Xanadu Universe [Internet]. 2016 [cited 2021 Oct 28]. Available from: <a href=\"https://xanadu.com/xUniverse-D6\">https://xanadu.com/xUniverse-D6</a></p><p>Rayward WB. Visions of Xanadu: Paul Otlet (1868–1944) and Hypertext. Journal of the American Society for Information Science. 1994;16.</p><p>Ridi R. Hypertext. Knowledge Organization. 2018;45(5):393–424.</p><p>Rosenberg D. History Debugged. In: Dechow DR, Struppa DC, editors. Intertwingled. Cham: Springer International Publishing; 2015. p. 91–103.</p><p>Van der Weel A. Changing Our Textual Minds: Towards a Digital Order of Knowledge. Manchester University Press; 2012.</p><h2 id=\"endnotes\">Endnotes</h2><div class=\"footnotes\" role=\"doc-endnotes\">  <ol>    <li id=\"fn:content_item\" role=\"doc-endnote\">      <p>Content items are what Steven DeRose (1990) calls “content objects,” what Charles van den Heuvel and W. Boyd Rayward (2011) call “information chunks,” and what Ridi (2018) calls “information units.” In conventional terms, a paragraph, for example, is a content item; a quote within a paragraph is also a content item; a list and a list item are content items. <a href=\"#fnref:content_item\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>    <li id=\"fn:distinctive_properties\" role=\"doc-endnote\">      <p>These distinctive properties, as discussed under the question <em>What are the distinct properties of a digital document versus a paper document?</em> in [Questions That Follow], means the computer holds greater potential than earlier analog mediums. Firstly, that the computer is a <em>universal machine</em> means “that it is an instrument capable of performing on text not only all medial functions such as creating, editing, storing, publishing, distributing and consuming it, but also operations of various kinds. [F]unctioning electronically and digitally, [it can] run every conceivable type of application (Weel 2012),” which by implication means that any conceivable construct can be embedded. A third distinctive property, which engendered transformative change, is that once computers began operating in a global digital network, the “medial role” of the computer went from being a tool for aiding “text production and printing to that of a wholly new digital medium in its own right” (Weel 2012). It became the medium that “covers the entire communications circuit, including the production (writing, editing) of texts, down to their distribution and even consumption” (Weel 2012). Nelson considered the potential of these properties for envisioning how the computer could become a <em>literary machine</em> transforming how we engage and work with text. <a href=\"#fnref:distinctive_properties\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>    <li id=\"fn:order_of_the_book\" role=\"doc-endnote\">      <p>As stated in [Questions That Follow], the <em>order of the book</em> is the presentation and structure of text based on the form of books and defined by the format of manuscript and print. <a href=\"#fnref:order_of_the_book\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>    <li id=\"fn:links_on_the_web\" role=\"doc-endnote\">      <p>Traversing content on the Web by selecting hyperlinks commonly entails blindly <em>jumping</em> and landing at the top of the page: <a href=\"#fnref:links_on_the_web\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>    <li id=\"fn:2003_prototype\" role=\"doc-endnote\">      <p>Note that the link direction is unclear, and the position and overlap of the windows are not convenient. <a href=\"#fnref:2003_prototype\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>    <li id=\"fn:3D_prototype\" role=\"doc-endnote\">      <p>One problem with this 3D version is that there is no obvious way of navigating the space. For reading and editing a document, it could be useful to snap into a full-frame view of a particular part of a document. <a href=\"#fnref:3D_prototype\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>    <li id=\"fn:sworfing\" role=\"doc-endnote\">      <p>The idea of viewing documents side-by-side is solid, but having documents fly in and out of view as you move through the document is not. There should be an interaction step in between, in which the content is only opened through deliberate action. <a href=\"#fnref:sworfing\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>    <li id=\"fn:front-end-design\" role=\"doc-endnote\">      <p>…the intention behind this project is to contribute to this aspect. <a href=\"#fnref:front-end-design\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>  </ol></div>",
            "url": "/forking_the_docuverse_weblog/03",
            
            
            
            
            
            "date_published": "2021-08-13T00:00:00+02:00",
            "date_modified": "2021-08-13T00:00:00+02:00",
            
                "author": 
                "Rebecca Rui"
                
            
        },
    
        {
            "id": "/forking_the_docuverse_weblog/02",
            "title": "Terms: Questions That Follow",
            "summary": null,
            "content_text": "The attempt here is to elaborate on the terms used in the previous entry.What is meant by paper document?A paper document primarily contains the modality text, and the medium1 used for its transmission is paper, meaning it encompasses the manuscript and print traditions.What are those biases and conventions inherited from paper documents?Conventions particular to paper documents are derived from what Adriaan van der Weel (2012) calls the Order of the Book — presentation and structure of text based on the form of books and defined by the format of manuscript and print. Engaging with paper documents thus requires familiarity with concepts such as a table of contents, chapters, running headers, page numbers, citations, reference lists, appendices, and how they are used as parts of a system. Beyond those pertaining specifically to the paper page are concepts derived from the environments in which people engage and work with paper documents. Examples are the clipboard, paper bin, folders, files, and activities such as cutting, pasting, and paging — transferred into the digital realm as metaphors. These are some of the conventions inherited from paper documents.An example of an inherited bias is how computer operating systems are based on a hierarchical taxonomic structure inherited from the paper document management system, called the file system. In accordance with the file system, a computer file must be named and can only be placed in one folder, which must also be named. If a file should be placed in multiple folders (because it belongs to multiple categories), that file must be copied into other folders.2 In other words, the constraints of that system are also inherited.Digital computers can be embedded with any conceivable construct, so if, for example, a file system based on a hierarchical taxonomic structure is not convenient, then such a system can and should be re-imagined.What is meant by digital document?A digital document primarily contains the modality text, and the medium used for its transmission is digital computers.What are the distinct properties of a digital document versus a paper document?Whereas a paper document primarily contains text but can also contain images and other graphic elements, a digital document can additionally contain video, sound, and other interactive elements.Operating under the premise (which is substantiated below) that the medium used for the transmission of text yields particular constraints and capacities, two distinct properties are relevant to the juxtaposition of paper documents and digital documents:  Text on the paper page is inscribed and static; text in the digital realm is encoded and dynamic (Weel 2012).  With text on the paper page, actions are direct; with text in the digital realm, actions are interactive.1. Text on the paper page is inscribed and static; text in the digital realm is encoded and dynamicWith text on the paper page, language takes a static material form. From a historical perspective, the materialization of language significantly impacted human cognition. In The Mind on Paper: Reading, Consciousness and Rationality, developmental psychologist David Olson (2017) gives an analysis incorporating a historical account of the relationship between literacy and forms of thought and by his account, engaging and working with paper documents engendered critical thinking and systematic knowledge (Olson 2017). Similar claims are made by Eric Havelock (1976), who in Origins of Western Literacy establishes an integral relationship between the technology of writing and rational and analytic thought. And on the study of reading and its impact on cognition, as Neil Postman (1986) points out, it has been concluded by most scholars “that the sequential, propositional character of the written word fosters what Walter Ong calls the ‘analytic management of knowledge.’”It is not suggested that analytic thought and rationality were not possible prior to written language, but to engage with text is “to follow a line of thought, which requires considerable powers of classifying, inference-making and reasoning.” It requires mapping ideas, comparing assertions, “connect[ing] one generalization to another” (Postman 1986). By example from research within the learning sciences, Roy Pea (1985) discusses the form of arguments, contrasting oral and written language, and its impact on logical analysis. With text on the paper page, human memory capacities were extended, allowing an argument to be stored and directly available to the reader/writer to evaluate the relationship between its parts for consistency and locate potential contradictions. With the advent of print technology, in particular, there was a greater capacity for “precision in the transmission of detail,” leading to a “much greater exactness in the representation of knowledge […] through the use of such typically typographic aids as tables and different typefaces, font sizes, and white space as a means of ordering information” (Weel 2012).  Uniformity, predictability, consistency, and standardization were prerequisites for analytical and scientific thinking. (Weel 2012)These effects on human cognition are related to the staticity of (and what it entails to engage with) text on the paper page.3 In contrast, digital text is marked by dynamicity and modifiability. At a basic level, digital text is encoded as a bit pattern (e.g., 1010111) representing a character unit (e.g., W). As Stéfan Sinclair and Geoffrey Rockwell (2016) suggest, these properties of digital text imply an infinite potential for rearrangement and restructuring through algorithmic play (i.e., move these bits here to there, extract only those bits, rearrange them according to this, then that, and put those here). At yet another level, digital text is encoded through a markup language. Encoding text involves “marking up” the structure, the visual presentation, and the metadata—all of which can be utilized in working with and modifying (the form, content, and meaning of) texts. Importantly, modification of digital text by modifying the code that transcribes the text can be done without repercussions to source content. That is, the process of rearranging parts, transforming between formats, extracting and sorting text segments, annotating or performing analyses on those extracted text segments involves operations that can be performed without repercussions to the source content. With paper documents, such actions are enacted directly upon the material, so additional information (e.g., annotations, symbols, citations, footnotes, and so on) is, by convention, congested on the same page.2. With text on the paper page, actions are direct; with text in the digital realm, actions are interactive.Any action is direct when engaging and working with text on the paper page. That is, actions such as writing, underlining, erasing, cutting out, pasting in, folding, stacking, sorting, and resorting, are in a direct relationship between the action, the operations involved in that action, and the perception of that action. In the digital realm, a command — a keystroke, a tap on a touchscreen, a verbal utterance — can equate near-infinite set of (opaque) operations. Given these distinctive properties, text in the digital realm invites modification of its parts in ways that are infeasible with text on the paper page. This project aims to explore the potential of these properties based on accommodating the interconnection of documents.What does it mean to map and access multiple text structures?To map is the activity of creating connections either by attaching metadata to documents or links between documents’ content items. Mapping text structure can be done by both the reader and writer of documents. To access is used to encompass retrieving, bringing into view, filtering, arranging, and traversing documents based on those connections in a coherent manner. The connections (in the form of interactive visual links) enable access based on documents or links belonging to the same category, or the kind that enables access based on a link path — pointing from one particular content item to another.What is the docuverse?The docuverse — as in universe of documents — is a term coined by Ted Nelson that describes a universal library system on networked computers. As Nelson writes in Literary Machines:  All of storage near and far must therefore become a united whole— what is now called a “distributed database.” […] The documents and their links unite into what is essentially a swirling complex of equi-accessible unity, a single great universal text and data grid, or, as we call it, the docuverse (Nelson 1987).In other words, the docuverse is a construct in which documents live, understood as a metadocument with all the information about documents’ contents and linkages, including their version history. The concepts and implementations of Nelson’s vision of the docuverse (among other historical examples of systems based on accommodating interconnection) are examined in the next entry.What is interconnection?See next entry.SourcesHavelock EA. Origins of Western Literacy. The Ontario Institute for Studies in Education; 1976.Olson DR. Awakening: Reading and Consciousness. The Mind on Paper: Reading, Consciousness and Rationality. Cambridge: Cambridge University Press; 2017.Nelson TH. Literary Machines: The report on, and of, Project Xanadu concerning word processing, electronic publishing, hypertext, thinkertoys, tomorrow’s intellectual revolution, and certain other topics including knowledge, education and freedom. 87.1. Sausalito, California: Mindful Press; 1987.Weel A van der. Changing Our Textual Minds: Towards a Digital Order of Knowledge. Manchester University Press; 2012.Pea RD. Beyond Amplification: Using the Computer to Reorganize Mental Functioning. Educational Psychologist. 1985;20(4):167–82.Postman N. Amusing Ourselves to Death: Public Discourse in the Age of Show Business. New York: Penguin Books; 1986.Sinclair S, Rockwell G. Text Analysis and Visualization: Making Meaning Count. A New Companion to Digital Humanities. 2016. p. 17.            As defined by Adriaan van der Weel (2012), modality, in computer terms, is analogous to data type, and medium is the equipment used for its transmission. The properties of a medium dictate the modality it can mediate. For example, a paper document can transmit the modalities text and image, while a digital document can transmit the modalities text, image, video, and sound. &#8617;              It should be noted that the Macintosh operating system System 6 introduced in 1988, offered a fixed seven-color label option for tagging files, enabling grouping mechanisms for sorting files and folders. This feature was not extended until 2013 when descriptive labels for tagging files were introduced on Mavericks. Software that extends the features of Finder — the graphical user interface shell employed on all Macintosh operating systems — includes ForkLift, TotalFinder, muCommander, and XtraFinder, to name a few. However, these are workarounds to the inflexibility of the file system grounded in restrictive organization principles. They are pieces of software developed to fix the problems of another piece of software. &#8617;              That is why this research project focuses on text, defining paper and digital documents as primarily containing text. &#8617;      ",
            "content_html": "<p>The attempt here is to elaborate on the terms used in the <a href=\"01\">previous entry</a>.</p><h2 id=\"what-is-meant-by-paper-document\">What is meant by <em>paper document</em>?</h2><p>A paper document primarily contains the modality text, and the medium<sup id=\"fnref:modality_and_medium\" role=\"doc-noteref\"><a href=\"#fn:modality_and_medium\" class=\"footnote\" rel=\"footnote\">1</a></sup> used for its transmission is paper, meaning it encompasses the manuscript and print traditions.</p><h2 id=\"what-are-those-biases-and-conventions-inherited-from-paper-documents\">What are those <em>biases and conventions inherited from paper documents</em>?</h2><p>Conventions particular to paper documents are derived from what Adriaan van der Weel (2012) calls the <em>Order of the Book</em> — presentation and structure of text based on the form of books and defined by the format of manuscript and print. Engaging with paper documents thus requires familiarity with concepts such as a table of contents, chapters, running headers, page numbers, citations, reference lists, appendices, and how they are used as parts of a system. Beyond those pertaining specifically to the paper page are concepts derived from the environments in which people engage and work with paper documents. Examples are the clipboard, paper bin, folders, files, and activities such as cutting, pasting, and paging — transferred into the digital realm as metaphors. These are some of the conventions inherited from paper documents.</p><p>An example of an inherited bias is how computer operating systems are based on a hierarchical taxonomic structure inherited from the paper document management system, called <em>the file system</em>. In accordance with the file system, a computer file must be named and can only be placed in one folder, which must also be named. If a file should be placed in multiple folders (because it belongs to multiple categories), that file must be <em>copied</em> into other folders.<sup id=\"fnref:macOS\" role=\"doc-noteref\"><a href=\"#fn:macOS\" class=\"footnote\" rel=\"footnote\">2</a></sup> In other words, the constraints of that system are also inherited.</p><p>Digital computers can be embedded with any conceivable construct, so if, for example, a file system based on a hierarchical taxonomic structure is not convenient, then such a system can and should be re-imagined.</p><h2 id=\"what-is-meant-by-digital-document\">What is meant by <em>digital document</em>?</h2><p>A digital document primarily contains the modality text, and the medium used for its transmission is digital computers.</p><h2 id=\"what-are-the-distinct-properties-of-a-digital-document-versus-a-paper-document\">What are the distinct properties of a digital document versus a paper document?</h2><p>Whereas a paper document primarily contains text but can also contain images and other graphic elements, a digital document can additionally contain video, sound, and other interactive elements.</p><p>Operating under the premise (which is substantiated below) that the medium used for the transmission of text yields particular constraints and capacities, two distinct properties are relevant to the juxtaposition of paper documents and digital documents:</p><ol>  <li>Text on the paper page is inscribed and static; text in the digital realm is encoded and dynamic (Weel 2012).</li>  <li>With text on the paper page, actions are direct; with text in the digital realm, actions are interactive.</li></ol><h3 id=\"1-text-on-the-paper-page-is-inscribed-and-static-text-in-the-digital-realm-is-encoded-and-dynamic\">1. Text on the paper page is inscribed and static; text in the digital realm is encoded and dynamic</h3><p>With text on the paper page, language takes a static material form. From a historical perspective, the materialization of language significantly impacted human cognition. In <em>The Mind on Paper: Reading, Consciousness and Rationality</em>, developmental psychologist David Olson (2017) gives an analysis incorporating a historical account of the relationship between literacy and forms of thought and by his account, engaging and working with paper documents engendered critical thinking and systematic knowledge (Olson 2017). Similar claims are made by Eric Havelock (1976), who in <em>Origins of Western Literacy</em> establishes an integral relationship between the technology of writing and rational and analytic thought. And on the study of reading and its impact on cognition, as Neil Postman (1986) points out, it has been concluded by most scholars “that the sequential, propositional character of the written word fosters what Walter Ong calls the ‘analytic management of knowledge.’”</p><p>It is not suggested that analytic thought and rationality were not possible prior to written language, but to engage with text is “to follow a line of thought, which requires considerable powers of classifying, inference-making and reasoning.” It requires mapping ideas, comparing assertions, “connect[ing] one generalization to another” (Postman 1986). By example from research within the learning sciences, Roy Pea (1985) discusses the form of arguments, contrasting oral and written language, and its impact on logical analysis. With text on the paper page, human memory capacities were extended, allowing an argument to be stored and directly available to the reader/writer to evaluate the relationship between its parts for consistency and locate potential contradictions. With the advent of print technology, in particular, there was a greater capacity for “precision in the transmission of detail,” leading to a “much greater exactness in the representation of knowledge […] through the use of such typically typographic aids as tables and different typefaces, font sizes, and white space as a means of ordering information” (Weel 2012).</p><blockquote>  <p>Uniformity, predictability, consistency, and standardization were prerequisites for analytical and scientific thinking. (Weel 2012)</p></blockquote><p>These effects on human cognition are related to the staticity of (and what it entails to engage with) text on the paper page.<sup id=\"fnref:primarily_text\" role=\"doc-noteref\"><a href=\"#fn:primarily_text\" class=\"footnote\" rel=\"footnote\">3</a></sup> In contrast, digital text is marked by dynamicity and modifiability. At a basic level, digital text is encoded as a bit pattern (e.g., 1010111) representing a character unit (e.g., W). As Stéfan Sinclair and Geoffrey Rockwell (2016) suggest, these properties of digital text imply an infinite potential for rearrangement and restructuring through algorithmic play (i.e., move these bits here to there, extract only those bits, rearrange them according to this, then that, and put those here). At yet another level, digital text is encoded through a markup language. Encoding text involves “marking up” the structure, the visual presentation, and the metadata—all of which can be utilized in working with and modifying (the form, content, and meaning of) texts. Importantly, modification of digital text by modifying the code that transcribes the text can be done without repercussions to source content. That is, the process of rearranging parts, transforming between formats, extracting and sorting text segments, annotating or performing analyses on those extracted text segments involves operations that can be performed without repercussions to the source content. With paper documents, such actions are enacted directly upon the material, so additional information (e.g., annotations, symbols, citations, footnotes, and so on) is, by convention, congested on the same page.</p><h3 id=\"2-with-text-on-the-paper-page-actions-are-direct-with-text-in-the-digital-realm-actions-are-interactive\">2. With text on the paper page, actions are direct; with text in the digital realm, actions are interactive.</h3><p>Any action is direct when engaging and working with text on the paper page. That is, actions such as writing, underlining, erasing, cutting out, pasting in, folding, stacking, sorting, and resorting, are in a direct relationship between the action, the operations involved in that action, and the perception of that action. In the digital realm, a command — a keystroke, a tap on a touchscreen, a verbal utterance — can equate near-infinite set of (opaque) operations. Given these distinctive properties, text in the digital realm invites modification of its parts in ways that are infeasible with text on the paper page. This project aims to explore the potential of these properties based on accommodating the interconnection of documents.</p><h2 id=\"what-does-it-mean-to-map-and-access-multiple-text-structures\">What does it mean to <em>map</em> and <em>access</em> multiple text structures?</h2><p><em>To map</em> is the activity of creating connections either by attaching metadata to documents or links between documents’ content items. Mapping text structure can be done by both the reader and writer of documents. <em>To access</em> is used to encompass <em>retrieving</em>, <em>bringing into view</em>, <em>filtering</em>, <em>arranging</em>, and <em>traversing</em> documents based on those connections in a coherent manner. The connections (in the form of interactive visual links) enable access based on documents or links belonging to the same category, or the kind that enables access based on a link path — pointing from one particular content item to another.</p><h2 id=\"what-is-the-docuverse\">What is the <em>docuverse</em>?</h2><p>The docuverse — as in <em>universe of documents</em> — is a term coined by Ted Nelson that describes a universal library system on networked computers. As Nelson writes in <em>Literary Machines</em>:</p><blockquote>  <p>All of storage near and far must therefore become a united whole— what is now called a “distributed database.” […] The documents and their links unite into what is essentially a swirling complex of equi-accessible unity, a single great universal text and data grid, or, as we call it, the docuverse (Nelson 1987).</p></blockquote><p>In other words, the docuverse is a construct in which documents live, understood as a metadocument with all the information about documents’ contents and linkages, including their version history. The concepts and implementations of Nelson’s vision of the docuverse (among other historical examples of systems based on accommodating interconnection) are examined in the <a href=\"03\">next entry</a>.</p><h2 id=\"what-is-interconnection\">What is <em>interconnection</em>?</h2><p>See <a href=\"03\">next entry</a>.</p><h2 id=\"sources\">Sources</h2><p>Havelock EA. Origins of Western Literacy. The Ontario Institute for Studies in Education; 1976.</p><p>Olson DR. Awakening: Reading and Consciousness. The Mind on Paper: Reading, Consciousness and Rationality. Cambridge: Cambridge University Press; 2017.</p><p>Nelson TH. Literary Machines: The report on, and of, Project Xanadu concerning word processing, electronic publishing, hypertext, thinkertoys, tomorrow’s intellectual revolution, and certain other topics including knowledge, education and freedom. 87.1. Sausalito, California: Mindful Press; 1987.</p><p>Weel A van der. Changing Our Textual Minds: Towards a Digital Order of Knowledge. Manchester University Press; 2012.</p><p>Pea RD. Beyond Amplification: Using the Computer to Reorganize Mental Functioning. Educational Psychologist. 1985;20(4):167–82.</p><p>Postman N. Amusing Ourselves to Death: Public Discourse in the Age of Show Business. New York: Penguin Books; 1986.</p><p>Sinclair S, Rockwell G. Text Analysis and Visualization: Making Meaning Count. A New Companion to Digital Humanities. 2016. p. 17.</p><div class=\"footnotes\" role=\"doc-endnotes\">  <ol>    <li id=\"fn:modality_and_medium\" role=\"doc-endnote\">      <p>As defined by Adriaan van der Weel (2012), modality, in computer terms, is analogous to data type, and medium is the equipment used for its transmission. The properties of a medium dictate the modality it can mediate. For example, a paper document can transmit the modalities text and image, while a digital document can transmit the modalities text, image, video, and sound. <a href=\"#fnref:modality_and_medium\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>    <li id=\"fn:macOS\" role=\"doc-endnote\">      <p>It should be noted that the Macintosh operating system <a href=\"https://arstechnica.com/gadgets/2013/10/os-x-10-9/9/\">System 6</a> introduced in 1988, offered a fixed seven-color label option for tagging files, enabling grouping mechanisms for sorting files and folders. This feature was not extended until 2013 when descriptive labels for tagging files were introduced on <a href=\"https://arstechnica.com/gadgets/2013/10/os-x-10-9/9/\">Mavericks</a>. Software that extends the features of Finder — the graphical user interface shell employed on all Macintosh operating systems — includes <a href=\"https://binarynights.com\">ForkLift</a>, <a href=\"https://totalfinder.binaryage.com\">TotalFinder</a>, <a href=\"https://www.mucommander.com\">muCommander</a>, and <a href=\"https://trankynam.com/xtrafinder/\">XtraFinder</a>, to name a few. However, these are workarounds to the inflexibility of the file system grounded in restrictive organization principles. They are pieces of software developed to fix the problems of another piece of software. <a href=\"#fnref:macOS\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>    <li id=\"fn:primarily_text\" role=\"doc-endnote\">      <p>That is why this research project focuses on text, defining paper and digital documents as primarily containing text. <a href=\"#fnref:primarily_text\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>  </ol></div>",
            "url": "/forking_the_docuverse_weblog/02",
            
            
            
            
            
            "date_published": "2021-08-08T00:00:00+02:00",
            "date_modified": "2021-08-08T00:00:00+02:00",
            
                "author": 
                "Rebecca Rui"
                
            
        },
    
        {
            "id": "/forking_the_docuverse_weblog/01",
            "title": "Outline: Introducing the Project and Detailing the Method",
            "summary": null,
            "content_text": "This is the first of a series of weblog entries that function as snapshots of the research process. This entry serves to introduce the topic of research, the research plan, and the scope of the project.  Title  Question  Hypothesis  Method  Documentation  Evaluation1. TitleTinkering with Textual Structures: A Digital ConstructA Construct for Tinkering With Digital TextA Construct for Tinkering With Digital DocumentsReconceiving Digital Documents: A Digital ConstructForked Path: The Re-conceptualization of Digital DocumentsForking the Docuverse: Mapping and Accessing Multiple Text StructuresForking the Docuverse2. QuestionWhat may result from undermining the biases and conventions inherited from paper documents when creating a construct for digital documents based on accommodating interconnection?3. HypothesisThe concept of interconnection implies that every text has multiple potential structures, which a construct in the digital realm can be created to reflect such that it enables new ways of working with text. It is contended that such a construct should support mapping and accessing those multiple text structures in a coherent and visual way.Text is confined by the material properties of the medium used for its transmission, whether that be inscribed tablets of gold or clay, or be it handwritten or printed ink on paper. Bound by the material properties of paper document formats such as books, conventions developed for mapping and visualizing interconnection in the ages of manuscript and print thus entailed embedding categories of information in the form of concepts such as footnotes, marginal annotations, and citations. Some such conventions have been transferred to the digital realm. Instead of embedding connections, a construct in the digital realm can represent connections in ways that are not feasible with paper documents. With that as a point of departure, this project entails creating a construct for digital documents with the aim to re-imagine how interconnection can be reflected.Mapping and visualizing interconnection within and between documents can result in complex layers of information. With that, the aim is to (1) design a system in which people can develop a customizable taxonomy that is continuously evolving and (2) create concepts (implemented as interactive visual components) for showing/hiding information categories through deliberate action. The design of construct will allow mapping and access to multiple structures of texts, and in effect, people switch between perspectives, shaping their understanding.4. MethodThe design of the construct aims to aid working with text by supporting activities for mapping and accessing multiple structures in a coherent and visual way. Within the bounds of feasibility, this project entails writing a text on the concept of interconnection (henceforth referred to as the main text), which is then mapped and visualized in the construct. The resulting interactive prototype will allow people to access what has been mapped. The following is a tentative outline of the process.Step 1: Concept DesignThis is the blueprint step. It entails creating sketches of the components that make up the construct, including how those components interact.Step 2: The Main TextThe main text consists of several parts that introduce and define the concept of interconnection, the underlying philosophical position, and provides historical examples of systems comprising concepts for representing interconnection. Through these examples, the biases and conventions inherited from paper documents are discussed, including the (dis)advantages of transferring these (or how these are transferred) to the digital realm. What is gathered through examining and evaluating historical examples is then utilized in creating a construct based on accommodating interconnection.In this sense, it results in a self-reflexive project. Throughout the process of writing the main text, small problems are expected to emerge. In response to these problems, interactive prototypes serving as potential solutions are created in the following step.Step 3: Interactive PrototypesThis step involves creating interactive prototypes of the construct, using the current state of the main text as sample content. The purpose is to determine what aspects work as intended and which ones need refining.Questions include how to design interactions for switching view modes or how different categories of information are visually distinguished. For example, if footnotes (as traditionally implemented in paper documents) are abandoned, then how are these categories of information (re-)conceptualized and visualized in the construct? The interactive prototypes created in this step (in combination with bi-weekly sessions with advisors) are expected to inform modifications to the design of the construct. As each informs the other, steps 2-3 are iterated until it is surmised that enough has been gathered for step 4.Step 4: ImplementationThis step involves completing the main text and the design of the construct by making improvements based on what has been gathered in the previous steps.5. DocumentationFor each iteration of steps 2-3, the resulting interactive prototypes are documented and published on this weblog. Each entry contains the current version of the main text and the design of the construct (i.e., the interactive prototypes described in step 3). A written reflection is included, serving to inform modifications for improvement. The final version of the construct (which includes the final version of the main text) is to be developed in prototyping software and published online.6. EvaluationThe documentation of the process and the final version of the construct inform the evaluation. The documentation of the process comprises written reflections of significant steps. The final version of the construct demonstrates one potential way of reflecting interconnection. In order for the construct to demonstrate new ways of working with text, the following points must be achieved:  Does the construct enable modification to the structure and presentation of the main text?  Does accessing those multiple structures reflect switching between perspectives on the main text?Questions are:  What is the data structure best suited for accommodating interconnection?  What are the most suited concepts for creating a digital construct for that data structure?  What visual form do those concepts take, and how do they interact?Functioning as a preliminary list, additions and modifications are expected throughout the process.",
            "content_html": "<p>This is the first of a series of weblog entries that function as snapshots of the research process. This entry serves to introduce the topic of research, the research plan, and the scope of the project.</p><ol>  <li>Title</li>  <li>Question</li>  <li>Hypothesis</li>  <li>Method</li>  <li>Documentation</li>  <li>Evaluation</li></ol><h2 id=\"1-title\">1. Title</h2><p><del>Tinkering with Textual Structures: A Digital Construct</del></p><p><del>A Construct for Tinkering With Digital Text</del></p><p><del>A Construct for Tinkering With Digital Documents</del></p><p><del>Reconceiving Digital Documents: A Digital Construct</del></p><p><del>Forked Path: The Re-conceptualization of Digital Documents</del></p><p><del>Forking the Docuverse: Mapping and Accessing Multiple Text Structures</del></p><p>Forking the Docuverse</p><h2 id=\"2-question\">2. Question</h2><p>What may result from undermining the biases and conventions inherited from paper documents when creating a construct for digital documents based on accommodating interconnection?<!-- WHAT: Accommodate interconnection.HOW: Re-imagine how interconnection can be reflected in the digital realm. --></p><h2 id=\"3-hypothesis\">3. Hypothesis</h2><p>The concept of interconnection implies that every text has multiple potential structures, which a construct in the digital realm can be created to reflect such that it enables new ways of working with text. It is contended that such a construct should support mapping and accessing those multiple text structures in a coherent and visual way.</p><p>Text is confined by the material properties of the medium used for its transmission, whether that be inscribed tablets of gold or clay, or be it handwritten or printed ink on paper. Bound by the material properties of paper document formats such as books, conventions developed for mapping and visualizing interconnection in the ages of manuscript and print thus entailed embedding categories of information in the form of concepts such as footnotes, marginal annotations, and citations. Some such conventions have been transferred to the digital realm. Instead of embedding connections, a construct in the digital realm can represent connections in ways that are not feasible with paper documents. With that as a point of departure, this project entails creating a construct for digital documents with the aim to re-imagine how interconnection can be reflected.</p><p>Mapping and visualizing interconnection within and between documents can result in complex layers of information. With that, the aim is to (1) design a system in which people can develop a customizable taxonomy that is continuously evolving and (2) create concepts (implemented as interactive visual components) for showing/hiding information categories through deliberate action. The design of construct will allow mapping and access to multiple structures of texts, and in effect, people switch between perspectives, shaping their understanding.</p><h2 id=\"4-method\">4. Method</h2><p>The design of the construct aims to aid working with text by supporting activities for mapping and accessing multiple structures in a coherent and visual way. Within the bounds of feasibility, this project entails writing a text on the concept of interconnection (henceforth referred to as <em>the main text</em>), which is then mapped and visualized in the construct. The resulting interactive prototype will allow people to access what has been mapped. The following is a tentative outline of the process.</p><h3 id=\"step-1-concept-design\">Step 1: Concept Design</h3><p>This is the blueprint step. It entails creating sketches of the components that make up the construct, including how those components interact.</p><h3 id=\"step-2-the-main-text\">Step 2: The Main Text</h3><p>The main text consists of several parts that introduce and define the concept of interconnection, the underlying philosophical position, and provides historical examples of systems comprising concepts for representing interconnection. Through these examples, the biases and conventions inherited from paper documents are discussed, including the (dis)advantages of transferring these (or how these are transferred) to the digital realm. What is gathered through examining and evaluating historical examples is then utilized in creating a construct based on accommodating interconnection.</p><p>In this sense, it results in a self-reflexive project. Throughout the process of writing the main text, small problems are expected to emerge. In response to these problems, interactive prototypes serving as potential solutions are created in the following step.</p><h3 id=\"step-3-interactive-prototypes\">Step 3: Interactive Prototypes</h3><p>This step involves creating interactive prototypes of the construct, using the current state of the main text as sample content. The purpose is to determine what aspects work as intended and which ones need refining.</p><p>Questions include how to design interactions for switching view modes or how different categories of information are visually distinguished. For example, if footnotes (as traditionally implemented in paper documents) are abandoned, then how are these categories of information (re-)conceptualized and visualized in the construct? The interactive prototypes created in this step (in combination with bi-weekly sessions with advisors) are expected to inform modifications to the design of the construct. As each informs the other, steps 2-3 are iterated until it is surmised that enough has been gathered for step 4.</p><h3 id=\"step-4-implementation\">Step 4: Implementation</h3><p>This step involves completing the main text and the design of the construct by making improvements based on what has been gathered in the previous steps.</p><h2 id=\"5-documentation\">5. Documentation</h2><p>For each iteration of steps 2-3, the resulting interactive prototypes are documented and published on this weblog. Each entry contains the current version of the main text and the design of the construct (i.e., the interactive prototypes described in step 3). A written reflection is included, serving to inform modifications for improvement. The final version of the construct (which includes the final version of the main text) is to be developed in prototyping software and published online.</p><h2 id=\"6-evaluation\">6. Evaluation</h2><p>The documentation of the process and the final version of the construct inform the evaluation. The documentation of the process comprises written reflections of significant steps. The final version of the construct demonstrates one potential way of reflecting interconnection. In order for the construct to demonstrate new ways of working with text, the following points must be achieved:</p><ul>  <li>Does the construct enable modification to the structure and presentation of the main text?</li>  <li>Does accessing those multiple structures reflect switching between perspectives on the main text?</li></ul><p>Questions are:</p><ul>  <li>What is the data structure best suited for accommodating interconnection?</li>  <li>What are the most suited concepts for creating a digital construct for that data structure?</li>  <li>What visual form do those concepts take, and how do they interact?</li></ul><p>Functioning as a preliminary list, additions and modifications are expected throughout the process.</p>",
            "url": "/forking_the_docuverse_weblog/01",
            
            
            
            
            
            "date_published": "2021-08-03T00:00:00+02:00",
            "date_modified": "2021-08-03T00:00:00+02:00",
            
                "author": 
                "Rebecca Rui"
                
            
        }
    
    ]
}